[
    {
        "id": "648ca02f-650e-47f8-b6db-5d0b43fa31c4",
        "ano": "2021",
        "numero": "QUESTÃO 01",
        "conteudo": "A chance de uma criança de baixa renda ter um futuro melhor que a realidade em que nasceu está,\nem maior ou menor grau, relacionada à escolaridade e ao nível de renda de seus pais. Nos países ricos,\no \"elevador social\" anda mais rápido. Nos emergentes, mais devagar. No Brasil, ainda mais lentamente.\nO país ocupa a segunda pior posição em um estudo sobre mobilidade social feito pela Organização\npara a Cooperação e Desenvolvimento Econômico (OCDE), em 2018, com dados de 30 países. Segundo\nos resultados, seriam necessárias nove gerações para que os descendentes de um brasileiro entre os\n10% mais pobres atingissem o nível médio de rendimento do país. A estimativa é a mesma para a\nÁfrica do Sul e só perde para a Colômbia, onde o período de ascensão levaria 11 gerações. Mais de\n1/3 daqueles que nascem entre os 20% mais pobres no Brasil permanece na base da pirâmide, enquanto\napenas 7% consegue chegar aos 20% mais ricos. Filhos de pais na base da pirâmide têm dificuldade\nde acesso à saúde e maior probabilidade de frequentar uma escola com ensino de baixa qualidade.\nA educação precária, em geral, limita as opções para esses jovens no mercado de trabalho.\nSobram-lhes empregos de baixa remuneração, em que a possibilidade de crescimento salarial para\nquem tem pouca qualificação é pequena — e a chance de perpetuação do ciclo de pobreza, grande.\n\nLEMOS, V. Brasil é o segundo pior em mobilidade social em ranking de 30 países. BBC News Brasil, 15 jun. 2018 (adaptado).\n\nA partir das informações apresentadas, é correto afirmar que\n\nO o fator ambiental e o fator demográfico afetam a mobilidade social observada, sendo ela menor nos\npaíses que apresentam as maiores taxas de natalidade.\n\nO a baixa organização social dos economicamente menos favorecidos determina a baixa mobilidade\nsocial da base para o topo da pirâmide.\n\nO a mobilidade social é caracterizada por um fator ancestral que se revela ao longo das gerações, sendo\num limitador da eficácia de políticas públicas de redução das desigualdades sociais.\n\nO a análise de mobilidade social permite a observação de um ciclo vicioso, que se caracteriza por uma\nsubida nas camadas sociais seguida de uma queda, repetindo-se esse ciclo de modo sucessivo.\n\nO a ascensão social depende de fatores viabilizadores que estão fora do alcance das camadas pobres,\no que ocasiona conflitos sociais em busca do acesso a tais fatores.\n\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 5\n|\n\nO enade2021\n\nR2 7202 16 Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "5f487818-c4ca-45b8-851c-79ed1e563d65",
        "ano": "2021",
        "numero": "QUESTÃO 02",
        "conteudo": "B hortal ça é feia ou\nestragada?\n\nEmqupo\n\nDisponível em: https://www.facebook.com/embrapa/photos/a.609357055926350/733391400189581/?type=1 &theater.\nAcesso em: 27 maio 2020.\n\n6 SISTEMAS DE INFORMAÇÃO\n|\n\nenade2021 MM\n\nExame Nacional de Desempenho dos Estudantes\n\nTEXTO II\n\nEm alguns países da Europa, permite-se que um produto de menor valor estético seja comercializado.\nEstamos falando de um pepino deformado ou de uma cebola pequena, mas não de um produto\ncontaminado com resíduos químicos ou agentes biológicos. No caso do Brasil, o problema vai além da\naparência, porque há hortaliças ruins — contaminadas, murchas, machucadas — que chegam às bancas\npara ser comercializadas.\n\nMas, se nos dois contextos há perda de alimentos e preconceito em relação às hortaliças fora do padrão\nvisual, mas boas para o consumo, quais seriam as alternativas para evitar o desperdício e melhorar a\nqualidade dos produtos? Para os pesquisadores do assunto, não adianta replicar a experiência europeia no\nBrasil, de exigir hortaliças esteticamente perfeitas, porque também teríamos produtos sendo desprezados\nainda na etapa de produção. Não devemos passar de um mercado pouco exigente, que gera desperdício\nno varejo e nas residências, para um mercado exigente que gera perda no campo.\n\nA solução do problema é conscientizar os diversos elos da cadeia produtiva, especialmente varejistas\ne consumidores, para que sejam esclarecidos sobre quais aspectos da aparência das hortaliças\ncomprometem a qualidade. Quanto maior a exigência do mercado por hortaliças de aparência perfeita,\nmaior o desperdício de alimentos. Por sua vez, quanto maior a exigência por hortaliças sem danos,\ncausados pela falta de cuidado e pela falta de higiene, menor será a perda de alimentos e maior a\nqualidade da alimentação da população brasileira.\n\nDisponível em: https://www.embrapa.br/busca-de-noticias/-/noticia/29626389/manuseio-correto-preserva-a-qualidade-e\n-a-vida-util-das-hortalicas. Acesso em: 27 maio 2020 (adaptado).\n\nConsiderando as informações apresentadas nos textos, avalie as asserções a seguir e a relação proposta\nentre elas.\n\nIl. O texto | sintetiza uma informação principal do texto Il, ao apresentar critérios distintivos de\nalterações visuais que têm efeitos puramente estéticos em produtos alimentícios daquelas que\ntêm implicações na qualidade desses produtos.\n\nPORQUE\n\nIl. O texto Il divulga que o aumento das perdas na cadeia produtiva de hortaliças no Brasil\né proporcional à elevação de exigências dos consumidores pela aparência de produtos\nagropecuários.\n\nA respeito dessas asserções, assinale a opção correta.\n\nO Asasserções le Il são proposições verdadeiras, e a Il é uma justificativa correta da |.\n\nO As asserções le Il são proposições verdadeiras, mas a Il não é uma justificativa correta da |.\nO A asserção | é uma proposição verdadeira, e a Il é uma proposição falsa.\n\nO A asserção | é uma proposição falsa, e a Il é uma proposição verdadeira.\n\nO Asasserções le Il são proposições falsas.\n\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 7\n|\n\nenade2021\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "a0b65f53-bba0-48d5-a794-52de0ea2b292",
        "ano": "2021",
        "numero": "QUESTÃO 03",
        "conteudo": "TEXTO |\n\nNa Alemanha nazista, no auge da Segunda Guerra Mundial, surgiu a necessidade de abrir mais espaço\npara os veículos automotivos. Com muitos ciclistas, as bicicletas viraram um empecilho, forçando a\ncriação de um espaço exclusivo para elas — talvez as primeiras ciclovias do mundo. Mas, se na década\nde 1940 os veículos eram prioridade, hoje, o uso de bicicletas — e das ciclovias — surge como uma das\nprincipais alternativas para melhorar a qualidade de vida nas grandes metrópoles. Quando políticas\npúblicas incentivam o uso de bicicletas como meio de transporte para curtas e médias distâncias, um\nnovo panorama se abre.\n\nCOSTA, J. Ciclovias ajudam a humanizar o espaço urbano. Ciência e Cultura. v. 68, n. 2, São Paulo, 2016 (adaptado).\n\nTEXTO II\n\nDisponível em: http://dopedal.blogspot.com/2012/05/charge-do-silverio-voz-da-serra.html. Acesso em: 29 de abr. 2020.\n\nConsiderando as informações apresentadas e o uso de bicicletas como alternativa para melhorar a\nqualidade de vida nas cidades, avalie as afirmações a seguir.\n\nIl. Dado que as bicicletas são veículos que ocupam pouco espaço na malha viária, prescinde-se de\ninvestimentos públicos em construção de ciclovias, sendo prioritárias campanhas de conscientização\nde motoristas a respeito dos benefícios do uso da bicicleta como meio de transporte.\n\nIl. O uso das bicicletas como meio de transporte contribui para a melhoria da qualidade de vida nas\ngrandes metrópoles, pois elas não emitem poluentes, além de esse uso proporcionar a prática de\natividade física.\n\nHI. A partir da Segunda Guerra Mundial, durante o governo da Alemanha nazista, o uso da bicicleta\ncomo meio de transporte tornou-se eficaz e passou a prevalecer nas cidades europeias.\n\nÉ correto o que se afirma em\n\nO | apenas.\n\nO Il apenas.\n\nO lelll, apenas.\nO lei, apenas.\nO Llell.\n\n8 SISTEMAS DE INFORMAÇÃO\n|\n\n\nenade2021 MM\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "fd9114fe-3a87-42c8-aafe-379f39b4b4c0",
        "ano": "2021",
        "numero": "QUESTÃO 04",
        "conteudo": "Além do contexto econômico, o avanço da tecnologia também é um dos responsáveis pelo aumento dos\ntrabalhadores informais. E a tendência de contratação de freelancers por meio de plataformas digitais,\ncomo aplicativos de delivery e de mobilidade urbana, ganhou até um nome: Gig Economy, ou economia\ndos bicos. Para os gigantes de tecnologia detentores desses aplicativos, os motoristas são trabalhadores\nautônomos, que não possuem vínculo empregatício. Além de não estarem sujeitos a nenhuma\nregulamentação e proteção legal, os profissionais que desenvolvem esse tipo de trabalho deixam de\ncontribuir para a Previdência Social e de possuir benefícios como Fundo de Garantia por Tempo de\nServiço (FGTS), férias e décimo terceiro salário. Não obstante, ainda arcam com todo o custo da atividade\nque exercem. Em uma reportagem que ouviu alguns desses trabalhadores, motoristas afirmaram sofrer\ncom problemas de coluna e com o estresse no trânsito, além das longas jornadas de trabalho. Por esses\nmotivos, a Gig Economy está no centro de uma discussão mundial acerca da responsabilidade dessas\ncompanhias milionárias sobre as condições de trabalho da mão de obra que contratam. No meio do limbo\njurídico, quem sofre são os trabalhadores dessas plataformas, que ficam duplamente desprotegidos —\npelas empresas e pelo Estado.\n\nDisponível em: https://exame.abril.com.br/carreira/quais-sao-as-consequencia-do-trabalho-informal-no-pais/.\nAcesso em: 18 abr. 2020 (adaptado).\n\nA partir das informações apresentadas, avalie as asserções a seguir e a relação proposta entre elas.\n\nIl. Trabalhadores autônomos informais que atuam em plataformas digitais sem qualquer vínculo\nempregatício, desprotegidos de regulamentação ou lei trabalhista, compõem a Gig Economy.\n\nPORQUE\n\nIl. Os trabalhadores, na Gig Economy, arcam com todos os custos necessários para desempenhar\no seu trabalho, ganham por produção e enfrentam longas jornadas diárias, o que os deixa mais\ndesgastados e com problemas de saúde.\n\nA respeito dessas asserções, assinale a opção correta.\n\nO As asserções le Il são proposições verdadeiras, e a Il é uma justificativa correta da |.\n\nO As asserções le Il são proposições verdadeiras, mas a Il não é uma justificativa correta da |.\nO A asserção | é uma proposição verdadeira, e a Il é uma proposição falsa.\n\nO A asserção | é uma proposição falsa, e a Il é uma proposição verdadeira.\n\nO As asserções le Il são proposições falsas.\n\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 9\n|\n\nA enade2021\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "cef056aa-909c-4696-8c49-c06a44d3ebdc",
        "ano": "2021",
        "numero": "QUESTÃO 05",
        "conteudo": "TEXTO |\n\nSegundo o Ministério da Saúde, em 2017 o Brasil registrou uma média nacional de 5,7 óbitos para\n100 mil habitantes. Na população indígena, foi registrado um número de óbitos três vezes maior que\na média nacional — 15,2. Destes registros, 44,8% (aproximadamente, 6,8 óbitos), são suicídios de\ncrianças e adolescentes entre 10 e 19 anos. Esses dados contrastam com o panorama nacional,\nem que o maior índice é entre adolescentes e adultos de 15 a 20 anos.\n\nDisponível em: https://www.cvv.org.br/blog/o-suicidio-do-povo-indigena/. Acesso em: 30 de abr. 2020 (adaptado).\n\nTEXTO II\n\nEvidências apontam que, em determinadas minorias étnico-raciais, como os indígenas (aborígines ou\npopulações nativas), o suicídio entre crianças apresenta taxas bem mais elevadas do que as observadas\nna população geral. No Brasil, o enforcamento foi utilizado mais frequentemente entre indígenas do que\nentre não indígenas, não se observando, no primeiro grupo, suicídios por intoxicação ou por armas de\nfogo. O mapa a seguir apresenta a distribuição dos óbitos por suicídio entre crianças e adolescentes\nindígenas no Brasil, entre os anos de 2010 e 2014.\n\nSuicídio indígena (10 a 14 anos)\n“1\n“2\n“3\n“4\no:\n0:\n\nSOUZA, M. Mortalidade por suicídio entre crianças indígenas no Brasil. Caderno de Saúde Pública, v.35, Rio de Janeiro, 2019 (adaptado).\n\n10 SISTEMAS DE INFORMAÇÃO\n|\n\nenade2021 um\n\nExame Nacional de Desempenho dos Estudantes\n\n27202111 %\n\nConsiderando as informações apresentadas e o alto índice de suicídio da população indígena, avalie as\nafirmações a seguir.\nIl. O elevado índice de suicídios entre crianças e adolescentes indígenas no país evidencia a\nnecessidade de ações com foco nos direitos fundamentais desses indivíduos.\n\nIl. Os estados do Pará e de Tocantins são os que possuem os maiores índices de suicídio de indígenas\nna faixa etária de 10 a 14 anos.\n\nHI. Os povos das tribos originárias do Brasil, no que tange a sua história e preservação cultural,\nnão estão amparados por direitos e garantias constitucionais.\n\nIV. O estabelecimento de ações preventivas ao suicídio nas comunidades indígenas deve considerar\nos elementos globais que afetam a população em geral, na faixa etária entre 15 e 20 anos.\n\nÉ correto apenas o que se afirma em\n\n[ANE\n\no 1.\n\nO ein.\n\nO lelv.\nO llelv."
    },
    {
        "id": "d72ab793-4af3-40ca-8002-dc985806a295",
        "ano": "2021",
        "numero": "QUESTÃO 06",
        "conteudo": "A pandemia ocasionada pelo novo Coronavirus gerou impactos negativos na economia e nos negócios,\nintensificando problemas sociais no mundo todo. Nos Estados Unidos, um estudo realizado com a\nparceria de duas importantes universidades verificou que a expectativa de vida dos norte-americanos\ncaiu 1,1 ano em 2020. A nova expectativa é de 77,4 anos. De acordo com o estudo, esta foi a maior queda\nanual da expectativa de vida já registrada nos últimos 40 anos. O declínio é ainda maior se considerada a\nexpectativa de vida para negros que moram no país, cuja queda foi de 2,1 anos. Para a população latina,\nessa queda foi de 3 anos. O declínio na expectativa de vida dos latinos é significativo, uma vez que eles\napresentam menor incidência de condições crônicas que são fatores de risco para a Covid-19 em relação\nàs populações de brancos e negros.\n\nLOUREIRO, R. Covid-19 reduz gravemente expectativa de vida de negros e latinos nos EUA. Revista Exame, 2021 (adaptado).\n\nConsiderando as informações apresentadas no texto, avalie as asserções a seguir e a relação proposta\nentre elas.\n\nIl. O efeito desproporcional da pandemia da Covid-19 na expectativa de vida da população negra e\nlatino-americana estabelece relação com sua situação de vulnerabilidade social.\n\nPORQUE\n\nIl. Uma hipótese que pode ser levantada quanto à diminuição da expectativa de vida de negros e\nlatino-americanos está relacionada às suas precárias condições de trabalho, levando-os a maior\npossibilidade de exposição ao contágio pelo novo Coronavírus.\n\nA respeito dessas asserções, assinale a opção correta.\n\nO Asasserções le Il são proposições verdadeiras, e a Il é uma justificativa correta da |.\n\nO As asserções le Il são proposições verdadeiras, mas a Il não é uma justificativa correta da 1.\nO A asserção | é uma proposição verdadeira, e a Il é uma proposição falsa.\n\nO A asserção | é uma proposição falsa, e a Il é uma proposição verdadeira.\n\nO Asasserções le Il são proposições falsas.\n\nSISTEMAS DE INFORMAÇÃO 11\n|\n\nMT enade2021\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "cd7f17d2-cac8-4510-9b77-ad784805c7a9",
        "ano": "2021",
        "numero": "QUESTÃO 07",
        "conteudo": "TEXTO |\n\nO estudo Internet and American Life Project, do Pew Research Center, demonstrou que, em 2009,\nmetade das buscas de temas relacionados à saúde na internet era feita para terceiros, e quase seis em\ncada dez pessoas que usaram meios digitais para se informar sobre saúde mudaram o enfoque com que\ncuidavam da própria saúde ou da de algum parente. Estima-se que exista uma correlação positiva entre o\ngrau de conhecimento das doenças (seus fatores de risco, formas de prevenção e tratamento) e a taxa de\nadoção de hábitos saudáveis pela sociedade. O aumento nos diagnósticos precoces do câncer de mama\ne a diminuição do tabagismo são dois exemplos clássicos a favor dessa ideia. Acredita-se que indivíduos\nmais bem informados aderem a comportamentos preventivos e reagem melhor a uma enfermidade.\n\nInfelizmente, a divulgação de temas médicos é uma faca de dois gumes: quem não sabe nada está mais\nperto da verdade do que a pessoa cuja mente está cheia de informações equivocadas. Conseguir que\na mensagem seja bem decodificada pelos receptores é o grande desafio que preocupa (ou deveria\npreocupar) tanto médicos quanto jornalistas.\n\nTABAKMAN, R. A saúde na mídia: medicina para jornalistas, jornalismo para médicos. Trad. Lizandra Magon de Almeida.\nSão Paulo: Summus Editorial, 2013 (adaptado).\n\nTEXTO II\n\nDe acordo com os dados da última TIC Domicílios — pesquisa realizada anualmente com o objetivo de\nmapear formas de uso das tecnologias de informação e comunicação no país —, aproximadamente\n46% dos usuários de Internet no Brasil utilizam a rede à procura de informações médicas sobre saúde em\ngeral e serviços de saúde. Para uma médica e pesquisadora da Fiocruz, os indivíduos sempre procuraram\ninformações sobre seu estado de saúde, mas é inegável que o surgimento da Internet trouxe um aumento\nsignificativo do acesso a informações amplificando assim os reflexos deste processo e alterando a relação\nentre os indivíduos. A pesquisadora chama a atenção para o perigo do autodiagnóstico e da automedicação,\nque podem gerar consequências nefastas tanto para os indivíduos quanto para a saúde pública, uma vez\nque boa parte dos estudos mostra que não são adotados critérios durante as buscas na Internet.\n\nDisponível em: https://agencia.fiocruz.br/conteudos-sobre-saude-na-web-alteram-relacao-medico-paciente. Acesso em: 16 abr. 2020 (adaptado).\nConsiderando a abordagem dos textos, avalie as afirmações a seguir.\n\nIl. Os textos | e Il evidenciam a importância de critérios nas buscas realizadas pelos usuários da\nInternet por informações sobre patologias, pois algumas informações podem trazer riscos à saúde\npor fomentarem a compreensão equivocada de sintomas e profilaxias.\n\nIl. O texto | afirma que a disponibilização de informações sobre temas de saúde nos meios de\ncomunicação tem contribuído para o esclarecimento da população acerca de hábitos saudáveis.\n\nHI. No texto II, defende-se o acesso a informações relativas a pesquisas da área da saúde nos veículos\nde comunicação, pois elas permitem que o indivíduo seja proativo na prevenção de patologias.\n\nÉ correto o que se afirma em\n\nO | apenas.\n\nO Ill, apenas.\n\nO lell, apenas.\nO lei, apenas.\nO Litein.\n\n12 SISTEMAS DE INFORMAÇÃO\n|\n\n\nenade2021\n\nExame Nacional de Desempenho dos Estudantes\n\n2720211 3%"
    },
    {
        "id": "a2a2b6a5-7e94-4757-90d9-4d23cf0769ae",
        "ano": "2021",
        "numero": "QUESTÃO 08",
        "conteudo": "Que é democracia? Em seu famoso discurso em Gettysburg, Abraham Lincoln disse que “a democracia\né o governo do povo, feito para o povo e pelo povo, e responsável perante o povo”. O crédito desta\ndefinição é, na verdade, de Daniel Webster, que a elaborou 33 anos antes de Lincoln em outro discurso.\nNesta ideia de “governo pelo povo e para o povo” surge uma questão essencial: e quando o povo estiver\nem desacordo? E quando o povo tiver preferências divergentes? O politólogo Arend Lijphart ressalta\nque há duas respostas principais: a resposta da “democracia majoritária” e a resposta da “democracia\nconsensual”. Na democracia majoritária, a resposta é simples e direta: deve-se governar para a maioria\ndo povo. A resposta alternativa, no modelo da democracia consensual é: deve-se governar para o máximo\npossível de pessoas.\n\nA virtude da democracia consensual é buscar consensos mais amplos no que é interesse de todos;\no desafio da democracia consensual pressupõe lideranças políticas mais maduras, tanto no governo\nquanto na oposição. Democratas genuínos têm aversão à ideia do totalitarismo e combatem os delírios\ndaqueles que desejam poder sem limites.\n\nDisponível em: https://g1.globo.com/politica/blog/matheus-leitao/post/2020/02/25/democracia-consensual-contra-a-tirania-da-maioria.ghtml.\nAcesso em: 2 maio 2020 (adaptado).\n\nA partir dos argumentos expostos no texto, avalie as afirmações a seguir.\nIl. O bem comum, a ser estabelecido por um governo democrático, nem sempre está associado às\nopiniões da maioria do povo.\n\nIl. A democracia consensual é caracterizada pelo consenso a ser alcançado entre situação e oposição,\nnas decisões governamentais.\n\nHI. Circunstâncias políticas de polarização, marcadas pela alta competitividade e combatividade entre\nposições divergentes, caracterizam um modelo de democracia majoritária.\n\nIV. Democracia consensual pressupõe que a situação política no poder considere em suas decisões as\nnecessidades das minorias, no sentido de governar para todo o povo.\n\nÉ correto apenas o que se afirma em\n\nO en.\nO elv.\nO led.\nO Lileiv.\nO IL lllelv.\n\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 13\n|\n\nAM enade2021\n\nExame Nacional de Desempenho dos Estudantes\n\nCOMPONENTE ESPECÍFICO\n\nQUESTÃO DISCURSIVA 03\n\nDados são uma descrição elementar de coisas, eventos, atividades ou transações que são registradas,\nclassificadas e armazenadas, mas não são organizados para carregar qualquer significado específico.\nQuando os dados são organizados e processados de tal forma que apresentam uma mudança\n(qualitativa ou quantitativa) tornando-se úteis, temos uma informação. Informações podem ser\nanalisadas para gerar conhecimento tácito ou explícito, experiência, aprendizado acumulado,\nconforme se aplicam a um problema ou atividade atual.\n\nTURBAN, E. et al. Administração da Tecnologia da Informação: Teoria e Prática. Rio de Janeiro: Elsevier, 2005 (adaptado).\n\nA partir das diferenças explicitadas no texto sobre dados, informação e conhecimento, faça o que se pede\nnos itens a seguir.\n\na) Cite cinco exemplos de dados. (valor: 2,5 pontos)\nb) Cite três exemplos de informação. (valor: 3,0 pontos)\n\nc) Cite três exemplos de conhecimento. (valor: 4,5 pontos)\n\nRASCUNHO\n\n1\n\n2\n\n3\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\nÁrea livre\n\n14 SISTEMAS DE INFORMAÇÃO\n|\n\nenade2021 O\n\nExame Nacional de Desempenho dos Estudantes\n\nQUESTÃO DISCURSIVA 04\n\nO conceito de sistemas pode ser enunciado por uma definição muito simples, porém de grande relevância.\nA ideia essencial da Teoria Geral de Sistemas é estabelecer uma nova visão da realidade, que transcenda\nos problemas tecnológicos das várias ciências e tenha generalidade suficiente para ser transdisciplinar.\n\nUm sistema é um conjunto de elementos interpendentes e interagentes, com vistas a atingir o mesmo\nobjetivo. A função básica de um sistema é a de converter os insumos retirados de seu ambiente, em\nprodutos de natureza qualitativa ou quantitativa diferente de seus insumos, para serem, então,\ndevolvidos ao seu ambiente.\n\nMARTINELLI, D. P. et al. Teoria Geral dos Sistemas. São Paulo: Saraiva, 2012 (adaptado).\n\nA figura a seguir é uma representação genérica de um sistema.\n\nRelação\n\nSubsistema 5\n\nSistema — Propósito\n\nConsiderando as informações apresentadas, redija um texto sobre sistema de informação. Em seu texto,\nexplique o que é subsistema e defina os conceitos de relação e de propósito. (valor: 10,0 pontos)\n\nRASCUNHO\n\n1\n\n2\n\n3\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\nSISTEMAS DE INFORMAÇÃO 15\n|\n\nAM enade2021\n\nExame Nacional de Desempenho dos Estudantes\n\nQUESTÃO DISCURSIVA 05\n\nUma loja pretende desenvolver um sistema cujo processo de modelagem utilizará UML\n(Unified Modeling Language). Essa empresa tem dois tipos de colaboradores, o atendente e o gerente.\nA principal atividade a ser automatizada pelo sistema é o processamento de vendas, cuja execução é\naltamente complexa. Dessa forma, a modelagem deve ser realizada de maneira estruturada e organizada,\ntendo como foco a sua reutilização em diferentes contextos. As vendas são realizadas quase integralmente\npor atendentes, entretanto, caso haja grande quantidade de clientes, os gerentes também podem\nprocessar vendas, por exemplo. O processamento de vendas pode ser realizado considerando duas\nmodalidades de pagamento: a prazo ou à vista, todavia, independentemente da forma de pagamento,\nhá um conjunto comum de ações que sempre são realizadas. As compras a prazo englobam dois modos\nde pagamento (via cartão de crédito e via boleto) que possuem ações comuns, mas que se diferem\nnas ações finais. Para algumas formas de processamento de vendas é aplicado um desconto sobre o\nvalor total. O desconto deve ser aplicado sempre que o pagamento for realizado à vista ou quando\no pagamento for realizado via boleto com parcelamento em até seis vezes. Entretanto, a loja oferece\ncomo forma de pagamento boleto com parcelamento em até doze vezes. No processamento de vendas,\napós a confirmação do pagamento, é necessário emitir a nota fiscal dos produtos. Apenas em\ncircunstâncias em que algum dos produtos vendidos não possa ser retirado na loja, deve ser possível\nsolicitar a entrega pelo sistema.\n\nConsiderando a situação apresentada no texto, faça o que se pede nos itens a seguir.\n\na) Indique o tipo de relacionamento que, de acordo com a linguagem UML, permite representar o fato\nde atendentes e gerentes poderem realizar as mesmas atividades. (valor: 3,0 pontos)\n\nb) Elabore um diagrama de caso de uso completo da UML para esse sistema, identificando os atores,\nos casos de uso e os relacionamentos. (valor: 7,0 pontos)\n\nRASCUNHO\n\n1\n\n2\n\n3\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16 SISTEMAS DE INFORMAÇÃO\n|\n\nenade2021 O\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "979c7c72-9993-41f3-a9f3-b269c854dcbd",
        "ano": "2021",
        "numero": "QUESTÃO 09",
        "conteudo": "O gestor de uma instituição seguradora solicitou ao desenvolvedor de software o projeto de uma solução\ncomputacional para a instituição. Após executar a análise de requisitos, esse desenvolvedor esboçou o\ndiagrama UML (Unified Modeling Language), contendo os elementos apresentados na figura a seguir.\n\nResidencial\n\nEm relação ao que é proposto no diagrama, avalie as afirmações a seguir.\nA classe Seguro é a superclasse de uma hierarquia de herança múltipla.\n|. O mecanismo de ligação entre as classes Segurado e Seguro é a associação.\nIl. As subclasses Residencial, Automotivo e Vida devem ser implementadas como classes abstratas.\nV. É permitido que um Segurado possa adquirir várias apólices de Seguro.\n\n[22\n\ncorreto apenas o que se afirma em\n\ne III.\nle Il.\nle IV.\nIle lv\nle IV\n\nVOO\n\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 17\n|\n\nME enade2021\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "e4994f4e-f4fb-40a8-9448-23956a457ee2",
        "ano": "2021",
        "numero": "QUESTÃO 10",
        "conteudo": "Na atual conjuntura, as organizações são pressionadas a assumirem posicionamentos cada vez mais\nresilientes, responsivos e inovadores. Para tanto, elas devem se empenhar na assimilação dos estímulos\ndo ambiente (mercados físicos ou virtuais), na avaliação de suas potencialidades e limitações, bem como\nna proposição de valor que atenda as expectativas e seus clientes.\n\nO gráfico a seguir apresenta os principais benefícios para as empresas em relação ao uso de redes sociais.\n\nDivulgação da\nsua marca\n\n53,0%\n\nEngajamento com\na sua audiência\n\nAumento de vendas e\ndo número de clientes\n\nAumento de tráfego\nno blog/site\n\nOutro\n\n0,0% 20,0% 40,0% 60,0%\n\nTerceira edição da Social Media Trends (2019). Disponível em: https://cdn2.hubspot.net/hubfs/\nAcesso em: 31 jul. 2021 (adaptado).\n\nConsiderando as informações apresentadas, avalie as afirmações a seguir.\nI. As redes sociais apresentam-se como oportunidades para a área de inteligência organizacional e\ncompetitiva, demandando uma nova arquitetura de informação nas organizações.\n\nIl. A interação dinâmica dos usuários pelas redes sociais fornece subsídios não apenas de consumidores,\nmas também de colaboradores e pode ser utilizada para análise e tomada de decisão.\n\nIl. A adoção de redes sociais pelas empresas demonstra a sua capacidade técnica para adotar esses\ndados no planejamento estratégico e na arquitetura da informação.\n\nIV. A inteligência organizacional e competitiva está baseada na capacidade de as organizações\nmonitorarem e analisarem as informações para que se adaptem e se desenvolvam de forma\nsustentável.\n\nÉ correto apenas o que se afirma em\n\nOlelv\n\nO ein.\n\nO lleiv.\n\nO ,lell.\n\nO Llelv.\n\n18 SISTEMAS DE INFORMAÇÃO\n\nenade2021\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "57753c85-4b17-4d75-bdd1-ef8a8a44f3f5",
        "ano": "2021",
        "numero": "QUESTÃO 11",
        "conteudo": "Uma empresa deseja se reposicionar no mercado\ne, para isso, precisa ampliar sua capacidade\nde atendimento em serviços computacionais.\nAtualmente, os sistemas infraestruturais e de\ninformação rodam sobre Sistemas Operacionais\nde diversas versões e distribuições, tanto na\nplataforma Windows, quanto na plataforma Linux.\nUma consultoria especializada propôs a migração\ndo parque de servidores físicos para servidores\nvirtuais, adotando-se o tipo Il, ou seja, os Monitores\nde Máquina Virtual serão executados como\nprocessos dos Sistemas Operacionais hospedeiros,\nmantendo-se, a princípio, os Sistemas Operacionais\ndo parque original como visitantes e adotando-se\num único Sistema Operacional como hospedeiro.\n\nSobre o modelo proposto pela consultoria, avalie as\nafirmações a seguir.\n\nIl. Os Sistemas Operacionais visitantes serão\ninfectados se algum malware se instalar no\nSistema Operacional hospedeiro.\n\nIl. A empresa, após a virtualização, economizará\nrecursos financeiros na aquisição de\nservidores e obterá mais eficiência no\nconsumo de recursos.\n\nll. A empresa não poderá manter a mesma\nestrutura de Sistemas Operacionais físicos\nno sistema virtualizado do tipo Il.\n\nIv. A recuperação do Sistema Operacional\nvirtual é mais simples e rápida, quando\ncomparada ao sistema físico.\n\nÉ correto apenas o que se afirma em\n\nO lei.\nO ltein.\nO ltelv.\nO ielv.\nO Llleiv.\n\nÁrea livre\n\n2720211 9%"
    },
    {
        "id": "a811a5f2-b1bf-44ad-9dbc-855425f2e1f2",
        "ano": "2021",
        "numero": "QUESTÃO 12",
        "conteudo": "A segurança dos dados refere-se às medidas\nque garantem confidencialidade, integridade\ne disponibilidade dos sistemas de informação\ne dos dados neles armazenados. É importante\ncompreender que a segurança dos dados exige\numa abordagem ampla em toda a empresa.\nCom base no exposto, não é possível proteger os\ndados se eles não forem resguardados por todos\nos processos que os circundam. A segurança dos\ndados depende de fatores como arquitetura dos\nsistemas, sistemas de hardware e software, rede\ne seus dispositivos, como também de pessoas\ninternas e externas à organização.\n\nROB, P.; CORONEL, C. Sistemas de banco de dados: projeto,\n\nImplementação e Gerenciamento. São Paulo:\n\nCengage Learning, 2011, p. 652 (adaptado).\n\nConsiderando a segurança em bancos de dados,\n\navalie as asserções a seguir e a relação proposta\nentre elas.\n\nIl. A confidencialidade dos dados é o que\ngarante que eles estejam protegidos contra\nacesso não autorizado e em caso de acesso\nautorizado, que sejam utilizados apenas\npara a finalidade designada.\n\nPORQUE\n\nIl. As permissões de acesso às informações\ncontidas nos bancos de dados dependem\ntambém da disponibilidade de acesso aos\ndados, sempre que solicitado por usuários\nautorizados para finalidades autorizadas.\n\nA respeito dessas asserções, assinale a opção correta.\n\nO As asserções le Il são proposições verdadeiras,\nea Il é uma justificativa correta da |.\n\nO As asserções le Il são proposições verdadeiras,\nmas a Il não é uma justificativa correta da |.\n\nO A asserção | é proposição verdadeira, e a Il é\numa proposição falsa.\n\nO A asserção | é proposição falsa, e a Il é uma\nproposição verdadeira.\n\nO As asserções le Il são proposições falsas.\n\nSISTEMAS DE INFORMAÇÃO 19\n\n2720212 0%"
    },
    {
        "id": "c77d246c-665f-43cb-b9ad-1f40a483ebd4",
        "ano": "2021",
        "numero": "QUESTÃO 13",
        "conteudo": "A qualidade do processo de desenvolvimento\nde software incide de forma direta sobre a\nqualidade do produto a ser entregue. Ressalta-se\nque a elaboração do software demanda a\nexecução de um projeto. Com isso, o processo de\ndesenvolvimento de software envolve criatividade\ne nesse contexto, as habilidades e a experiência de\ncada desenvolvedor influenciam significativamente\nos resultados. Além disso, fatores externos,\ntais como novas tecnologias ou pressões para a\nantecipação de prazo para liberação de um release\ntambém podem interferir na qualidade do produto,\nindependente do processo de software utilizado.\n\nSOMMERVILLE, |. Engenharia de Software. 8. ed. São Paulo:\nPearson, 2007, p. 425 (adaptado).\n\nConsiderando o contexto da qualidade de\nprocesso e de produto de software, avalie as\nafirmações a seguir.\n\nIl. O gerenciamento de qualidade de processo\ne seu contínuo aprimoramento contribuem\npara a produção de um software com\npoucos defeitos.\n\nHW. A definição de padrões de processo,\ndeterminando os parâmetros para a\nrealização das revisões de software, são\nfundamentais para gerenciar a qualidade do\nprocesso de software.\n\nll. O “monitoramento do processo de\ndesenvolvimento de software é essencial\npara garantir que os padrões adotados\nestejam sendo devidamente seguidos.\n\nIv. O gerente de projetos deve definir\nprocessos que estabeleçam meios para\natingir a qualidade de software, além de\ncriar ou adotar métricas que permitam à\norganização avaliar se o software possui o\nnível de qualidade necessário.\n\nÉ correto apenas o que se afirma em\n\nenade2021\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "997a7b32-f33f-457d-bd35-340279913488",
        "ano": "2021",
        "numero": "QUESTÃO 14",
        "conteudo": "Projetado para ser compreensível, acessível, flexível\ne integrado a outras abordagens, como a ágil,\no modelo Capability Maturity Model Integration\nCMMiI-Dev (Desenvolvimento) ajuda as organizações\na entender seu nível atual de capacidade e\ndesempenho, oferecendo um guia para otimizar os\nresultados dos negócios.\n\nDisponível em: https://cmmiinstitute.com/cmmi/intro.\nAcesso em: 27 jun. 2020 (adaptado).\n\nO modelo MPS para software (MPS-SW) tem\ncomo base os requisitos de processos definidos\nnos modelos de melhoria de processo e atende\na necessidade de implantar os princípios de\nengenharia de software de forma adequada\nao contexto das empresas, estando em\nconformidade com as principais abordagens\ninternacionais para definição, avaliação e\nmelhoria de processos de software.\n\nDisponível em: http://softex.br/mpsbr/modelos/tmpssw.\nAcesso em: 27 jun. 2020 (adaptado).\n\nEm relação aos modelos CMMI-Dev e MPS-SW,\navalie as afirmações a seguir.\n\nIl. Os dois modelos são organizados em\nchamados níveis de maturidade, porém a\nquantidade de níveis no modelo MPS-SW é\nmaior do que a apresentada no CMMI-Dev.\n\nIl. Os dois modelos levam em consideração\na Engenharia de Software para a\nimplementação dos processos em todos os\nníveis, sem a necessidade de alinhamento\ncom o planejamento estratégico da empresa.\n\nIl. Quanto maior o nível de maturidade de\numa organização, mais avançada é sua\norientação estratégica e sua capacidade de\naplicação dos processos relacionados, o que\npossivelmente implica melhores resultados.\n\nÉ correto o que se afirma em\n\nQ lei. O 1, apenas.\nOlelv. O Ii, apenas.\nOlelv. O le ll, apenas\nO Lille. O lle il, apenas.\nO ILilelv. O le.\n\n20 SISTEMAS DE INFORMAÇÃO\n\nenade2021\n\nExame Nacional de Desempenho dos Estudantes\n\n2720212 1%"
    },
    {
        "id": "1afaab78-f268-4243-abfa-0a26fac7757f",
        "ano": "2021",
        "numero": "QUESTÃO 15",
        "conteudo": "Os projetos são um esforço temporário empreendido para criar um produto, serviço ou resultado único.\n\nPMI. Guia PMBOK: Um Guia para o Conjunto de Conhecimentos em Gerenciamento de Projetos.\n6. ed. Pennsylvania: PMI, 2017 (adaptado).\n\nCom base na definição de projetos apresentada, avalie as afirmações a seguir.\n\nIl. Acriação de um produto único, ou um item do produto, pode representar um possível projeto.\nIl. Umserviço único, ou uma capacidade de realizar um serviço, pode representar um possível projeto.\nHI. A operação de um software, mesmo que repetidas vezes, pode representar um possível projeto.\n\nIV. Uma combinação única de um ou mais produtos, serviços ou resultados, pode representar um\npossível projeto.\n\nÉ correto apenas o que se afirma em\n\nO ein.\nO ein.\nO lelv.\nO úielv.\nO Llleiv."
    },
    {
        "id": "5f6c9591-a546-450b-86b1-80595fe8596a",
        "ano": "2021",
        "numero": "QUESTÃO 16",
        "conteudo": "A computação em nuvem é caracterizada por um conjunto de recursos virtualizados e disponibilizados\nvia internet. Os recursos podem ser configurados dinamicamente, fornecendo a base para a escalabilidade\nsob demanda. O vínculo com a computação em nuvem geralmente se baseia em um modelo de\npagamento por uso, no qual as garantias são oferecidas por meio de SLAs (acordos de nível de serviço)\npersonalizados. Os provedores de computação em nuvem oferecem essas camadas aos clientes por\nmeio de várias interfaces (incluindo ferramentas de linha de comando, ambientes de programação e\ninterfaces Web), levando a três tipos diferentes de serviços:\n\ne Infraestrutura como Serviço (laaS);\ne Plataforma como Serviço (PaasS);\n\ne Software como Serviço (SaaS).\n\nVAQUERO, L. M. et al. A Break in the Clouds: Towards a Cloud Definition.\nACM SIGCOMM Computer Communication Review, 2009 (adaptado).\n\nConsiderando as informações apresentadas, avalie as afirmações a seguir.\n\nIl. O uso do laaS é recomendado para pequenas e médias empresas cujo crescimento da\ninfraestrutura não acompanha sua expansão, bem como para empresas que possuem demandas\noscilantes, como lojas virtuais.\n\nIl. O uso de lasS e SaasS não é recomendado quando há restrições legais quanto ao armazenamento\nou terceirização dos dados, como ocorre muitas vezes em empresas e autarquias públicas.\n\nHI. O uso de SaaS é recomendado para grandes empresas que estão dispostas a investir em grande\nescala na compra de licenças.\n\nIV. O uso de Paas não é indicado para empresas que possuem um time próprio de desenvolvedores.\n\nÉ correto apenas o que se afirma em\n\nO lel.\n\nO ein.\nO Ilelv.\nO ielv.\nO Ip lllelv.\n\nSISTEMAS DE INFORMAÇÃO 21\n|\n\nAM enade2021\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "ee5f020e-bc5c-4c69-bf55-1d524b8a3c2a",
        "ano": "2021",
        "numero": "QUESTÃO 17",
        "conteudo": "O funcionamento da internet está baseado no roteamento de pacotes do tipo IP (Internet Protocol).\nCom relação a este protocolo e aos equipamentos utilizados para roteá-lo, avalie as afirmações a seguir.\nIl. Um pacote IPv4 pode ficar em /o0p indefinidamente, caso haja erros nas tabelas de roteamentos\ndos roteadores.\n\nIl. Em uma intranet com mais de um roteador, o sequenciamento de pacotes IPv4 é garantido por\nmeio do campo TTL.\n\nHI. Um pacote IPv4 pode ser fragmentado por qualquer dispositivo na rede, se o tamanho máximo de\nMTU da rede onde os pacotes vão transitar for menor que o tamanho do pacote a ser transmitido.\n\nIV. Ao enviar um pacote IPv4, a máscara de subrede é utilizada pelo computador ou roteador para\nidentificar se o computador de destino pertence a esta mesma subrede.\n\nÉ correto apenas o que se afirma em\n\nO lel.\n\nO ein.\n\nO Ilelv.\nO ielv.\nO Ip lllelv."
    },
    {
        "id": "82058f2d-29e5-492e-bdf4-54477ffdfdb2",
        "ano": "2021",
        "numero": "QUESTÃO 18",
        "conteudo": "A versão por estágios do Modelo Integrado de Maturidade em Capacitação (CMMI - Capability Maturity\nModel Integration) permite que o desenvolvimento de sistemas e processos de gerenciamento de uma\norganização seja avaliado e que a ele seja atribuído um nível de maturidade.\n\nSOMMERVILLE, |. Engenharia de Software. 9. ed. São Paulo: Pearson Prentice Hall, 2011 (adaptado).\nConsiderando a informação apresentada, suponha que uma determinada organização tenha\nprocessos de gerenciamento bem caracterizados, descritos por padrões, além de utilizar ferramentas\ne métodos estabelecidos.\n\nDe acordo com a versão por estágios do CMMI, esta organização possui os requisitos mínimos necessários\npara atingir qual nível de maturidade?\n\nO Inicial.\n\nO Definido.\n\nO Gerenciado.\n\nO Em otimização.\n\nO Gerenciado quantitativamente.\n\nÁrea livre\n\n22 SISTEMAS DE INFORMAÇÃO\n|\n\nenade2021\n\nExame Nacional de Desempenho dos Estudantes\n\n2720212 3%"
    },
    {
        "id": "fed7fdf5-1a58-4f53-ada0-501decc06d59",
        "ano": "2021",
        "numero": "QUESTÃO 19",
        "conteudo": "O gerenciamento de serviços de Tl tem como objetivo a entrega e o suporte de serviços de Tl focados nas\nnecessidades dos clientes e alinhados à estratégia de negócio da organização. Esta visa alcançar custos e\ndesempenho desejados pelo cliente, por meio de acordos de nível de serviço estabelecidos internamente\nentre a área de Tl e as demais áreas envolvidas na cadeia do serviço.\n\nMAGALHÃES, L. et al. Gerenciamento de Serviços de TI na Prática: Uma abordagem com base na ITIL.\nSão Paulo: Novatec, 2007 (adaptado).\n\nA partir das informações do texto, avalie as asserções a seguir e a relação proposta entre elas.\n\nIl. O acordo de nível de serviço é um contrato firmado entre o provedor de serviços de Tl e\nseus clientes, que incluem detalhes de quais serviços serão fornecidos.\n\nPORQUE\n\nIl. Os serviços devem ser monitorados quanto ao desempenho e disponibilidade no nível em que for\nacordado entre as partes.\n\nA respeito dessas asserções, assinale a opção correta.\n\nO Asasserções le Il são proposições verdadeiras, e a Il é uma justificativa correta da |.\n\nO As asserções le Il são proposições verdadeiras, mas a Il não é uma justificativa correta da |.\nO A asserção | é uma proposição verdadeira, e a Il é uma proposição falsa.\n\nO A asserção | é uma proposição falsa, e a Il é uma proposição verdadeira.\n\nO Asasserções le Il são proposições falsas."
    },
    {
        "id": "153b13d7-a5ce-493a-ad13-410fadaa8564",
        "ano": "2021",
        "numero": "QUESTÃO 20",
        "conteudo": "O paradigma de programação em lógica constitui-se como um processo de definição de relações em que\nse constroem fatos e regras sobre os elementos e suas relações. A ativação dos programas acontece por\nmeio de consultas (ou perguntas) sobre o relacionamento definido. Ao construir-se um banco de dados\nreferente a uma família, inicia-se pelas relações de parentesco, tais como:\npai (joão, maria) convencionado que joão é pai de maria\nmãe (maria, luiz) convencionado que maria é mãe de luiz\nAs cláusulas, sem condições, definem os fatos sobre o domínio do problema. De outra maneira,\né possível definir as regras que são cláusulas com condições:\navô materno (joão, luiz) :-pai (joão,maria), mãe (maria, luiz)\nNesse contexto, avalie as afirmações a seguir.\n\nIl. Aconsultamãe (maria, X) retorna verdadeiro conforme identificado na cláusula.\n\nIl. A conclusão joão é avô materno de luiz é identificada como cabeça da cláusula.\n\nll. Aregra irmão (X,Y):-pai(Z, X), pai(Z, Y) é uma regra genérica que define irmãos\npor parte de pai.\n\nIv. Aregraavo materno (X,Y):-pai (Z,X), mae(Y,Z) é uma regra genérica para o programa.\nÉ correto apenas o que se afirma em\n\nOle.\nO ein.\nO lleiv.\nO ielv.\nO Lilelv.\n\nSISTEMAS DE INFORMAÇÃO 23\n\nA enade2021\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "db4bbdd2-0e03-4b2e-99c8-1c1dd6e6b02e",
        "ano": "2021",
        "numero": "QUESTÃO 21",
        "conteudo": "Dado o controle de estoques de uma empresa de produção e embarque de peças, observe a descrição do\nesquema relacional abaixo para as tabelas Peça, Fornecedor e Embarque.\n\nPeça (CodPeça, NomePeça, CorPeça, PesoPeça)\nFornecedor (CodFornecedor, NomeFornecedor, StatusFornecedor)\n\nEmbarque (CodPeça, CodFornecedor, QuantidadeEmbarque), tal que CodPeça\nreferencia Peça e CodFornecedor\n\nreferencia Fornecedor.\n\nConsidere que os atributos sublinhados no esquema relacional representam as chaves primárias das\ntabelas. Considere, ainda, que é necessário executar um comando Structured Query Language (SQL)\nque recupere todas as tuplas na base de dados (CodPeça, NomePeça) que possuem a quantidade de\npeças embarcadas maior do que 100.\n\nCom base nessas informações, avalie os comandos a seguir.\nIR SELECT Embarque.CodPeça, Peça.NomePeça\nFROM Peça WHERE CodPeça IN\n\n(SELECT Embarque.CodPeça\nFROM Embarque\n\nWHERE Embarque.QuantidadeEmbarque > 100);\n\n[08]\n[Ea]\n\nLECT Peça.CodPeça, Peça.NomePeça\n\ne!\n\nROM Peça Embarque\n\nWHERE Peça.CodPeça = Embarque.CodPeça AND\nmbarque .QuantidadeEmbarque > 100;\n\nti\n\nHI. S\n\n[Ea\n\nLECT P.CodPeça, P.NomePeça\n\ne!\n\nROM Peça P JOIN Embarque E ON P.CodPeça = E.CodPeça AND\n.QuantidadeEmbarque > 100;\n\n[Ea\n\n<\n[08]\n[Ea]\n\nLECT CodPeça, NomePeça\n\ne!\n\nROM Peça JOIN Embarque ON Peça.CodPeça = Embarque.CodPeça AND\nEmbarque.QuantidadeEmbarque > 100;\n\nSão comandos SQL que promovem a recuperação da informação apenas os descritos em\n\nOle.\n\nO elv.\n\nO lei.\n\nO 4ileiv.\n\nO Iblllelv.\n\n24 SISTEMAS DE INFORMAÇÃO\n\nenade2021 O\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "3dc8d70c-5066-4c3d-8b75-11a6be3cfc89",
        "ano": "2021",
        "numero": "QUESTÃO 22",
        "conteudo": "A gerência de projetos é utilizada por diversas áreas e atualmente se faz presente também em várias\nfrentes da computação, como no desenvolvimento e implantação de softwares e hardwares. O gerente\nde projetos desenvolve um papel fundamental na condução de um projeto, resolvendo conflitos,\nadministrando interesses das partes e acompanhando a evolução do projeto.\nPMI. Guia PMBOK: Um Guia para o Conjunto de Conhecimentos em Gerenciamento de Projetos.\n6. ed. Pennsylvania: PMI, 2017 (adaptado).\nCom base no texto apresentado, avalie as afirmações a seguir.\n\nIl. O termo de abertura do projeto define, além das partes interessadas, os limites do projeto e do\norçamento, quando necessário.\n\nIH. Na Estrutura Analítica do Projeto (EAP), o gerente de projetos define os pacotes de entregas bem\ncomo a responsabilidade pelas mesmas.\n\nIll. É papel do gerente de projetos trocar membros da equipe de projeto, caso seja necessário,\npara garantir o andamento do projeto e prazos de entrega.\n\nIV. Após a separação do projeto em pacotes de entregáveis, é criada a matriz de responsabilidade,\npor meio da qual os integrantes do projeto são separados de acordo com os entregáveis e\nrespectivos prazos.\n\nÉ correto apenas o que se afirma em\n\nQ el.\nO ltelv.\nO Iltelv.\nO ,lell.\nO Llleiv.\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 25\n|\n\n* R2 720212 6 *"
    },
    {
        "id": "958e9cec-fc78-4e79-9117-13cafa872fb0",
        "ano": "2021",
        "numero": "QUESTÃO 23",
        "conteudo": "enade2021\n\nExame Nacional de Desempenho dos Estudantes\n\nÉ possível recuperar conjuntos de dados de forma organizada e que façam sentido para gerar informações.\nNesse contexto, a recuperação de informações gravadas nos bancos de dados ocorre por meio de\nconsultas SQL - Structured Query Language (linguagem de consulta de dados estruturados).\n\nConsidere o seguinte conjunto de tabelas de banco de dados:\n\nMOTORISTA\nIDMOTO NOME TELEFONE IDADE\n\n22 José 8888-0000 45\n\n29 Maria 9999-0000 33\n\n31 Antônio Null 35\n\n32 Carlos 3333-9999 16\n\n58 Josefina 3333-0000 60\n\n64 Marilda 3333-1111 26\n\nCARRO\nIDCARRO NOMECARRO COR\n101 Ônix Vermelho\n102 Gol Vermelho\n103 Civic Verde\n104 Pálio Azul\nRESERVAS\nIDMOTO IDCARRO DIA\n22 101 07/08/2020\n22 102 07/08/2020\n22 103 09/08/2020\n22 104 10/08/2020\n31 102 10/08/2020\n31 103 11/08/2020\n64 101 13/08/2020\n26 SISTEMAS DE INFORMAÇÃO\n\n\nenade2021\n\nExame Nacional de Desempenho dos Estudantes\n\n* R2 720212 7%\n\nCom base nas informações apresentadas, qual das seguintes consultas traria o nome dos motoristas que\n\nreservaram os carros vermelhos?\n\nQ SELECT M.NOME\nFROM MOTORISTA M\nWHERE M. IDMOTO IN\n(SELECT R.I\n\nDMOTO\n\nFROM RESERVAS R\n\nWHERE R.ID\n(SELECT C\n\nCARRO NOT IN\n- IDCARRO\n\nFROM CARRO C\n\nWHERE C\n\n[B) SELECT M.NOME\nFROM MOTORISTA M\nWHERE M. IDMOTO IN\n(SELECT R.I\n\n«COR = “Vermelho”))\n\nDMOTO\n\nFROM RESERVAS R\n\nWHERE R.ID\n(SELECT C\n\nCARRO IN\n- IDCARRO\n\nFROM CARRO C\n\nWHERE C\n\n(C) SELECT M.NOME\nFROM MOTORISTA M\nWHERE M. IDMOTO IN\n(SELECT R.I\n\n«COR = “Vermelho”))\n\nDMOTO\n\nFROM RESERVAS R\nWHERE R.IDCARRO NOT IN\n\n(SELECT C\n\n- IDCARRO\n\nFROM CARRO C\n\nWHERE C\n\n(D) SELECT M.NOME\nFROM MOTORISTA M\n\n«COR = “Vermelho”))\n\nWHERE M.IDMOTO NOT IN\n\n(SELECT R.lI\n\nDMOTO\n\nFROM RESERVAS R\n\nWHERE R.ID\n(SELECT €\n\nWHERE C\n\n(E) SELECT M.NOME\nFROM MARINHEIROS\n\nWHERE M.IDMARI NO\n(SELECT R.l\n\nCARRO NOT IN\n- IDCARRO\n\nFROM CARRO C\n\n«COR = “Vermelho”))\n\nM\nT IN\nDMARI\n\nFROM RESERVAS R\n\nWHERE R.ID\n(SELECT B\n\nWHERE B\n\nBARCO ANY\n. IDBARCO\n\nFROM BARCO B\n\n«COR = “Vermelho”))\n\nSISTEMAS DE INFORMAÇÃO\n|\n\n27\n\nMV enade2021\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "d555d0d3-bab9-47a8-b922-f1eb5e4075e4",
        "ano": "2021",
        "numero": "QUESTÃO 24",
        "conteudo": "A pesquisa operacional é tanto ciência quanto arte. Ciência por causa das técnicas matemáticas envolvidas\n\n(objetivo) e arte porque o sucesso das fases que precedem e sucedem a solução do modelo matemático\n\ndepende muito da criatividade e experiência dos profissionais de pesquisa operacional (subjetivo).\nARENALES, M. et al. Pesquisa Operacional. Rio de Janeiro: Elsevier, 2011, p. 5 (adaptado).\n\nSuponha que uma empresa de montagem de computadores fabrica três tipos básicos de dispositivos:\ndesktops, notebooks e netbooks. A produção da empresa ocorre em suas duas fábricas, uma na zona\nfranca de Manaus e outra na região Sul do país. De acordo com a última venda realizada, a empresa\nprecisa entregar 16 mil desktops, 6 mil notebooks e 28 mil netbooks. A fábrica de Manaus tem\ncusto de produção diário de R$150.000,00 para produção de 8 mil desktops, mil notebooks e 2 mil\nnetbooks. O custo de produção diário da fábrica da região Sul é de R$ 210.000,00 para a produção de\n2 mil desktops, mil notebooks e 7 mil netbooks.\n\nConsiderando as informações apresentadas, escolha o modelo que representa a situação descrita e\ndetermina a quantidade de dias que cada uma das fábricas deverá operar para atender à demanda do\npedido ao menor custo.\n\nQ Min , = 150.000 x+ 210.000y\nSujeito a :\nRi = 8x+2y <= 16\n\nR2= x+y <=6\nR3= 2x+7y <=28\n[B) Min , = 150.000 x+ 210.000y\n\nSujeito a :\n\nRi = 8x+2y >= 16\nR2= x+y >= 6\nR3= 2x+7y >=28\n\nIC) Min , = 150.000 x+ 210.000y\nSujeito a :\nRI = 8x+y = 16\nR2= x+y =—6\nR3= 2x+7y >=28\n\n[D) Min , = 150.000 x+ 210.000y\nSujeito a :\nRi = 8x-2y <=16\nR2=x-y <=6\nR3= 2x-7y <=28\ne Min , = 150.000 x+ 210.000 y\nSujeito a :\nRi = 8x-2y <=16\nR2= x+y <=6\nR3= 2x-7y <=28\n\n28 SISTEMAS DE INFORMAÇÃO\n|\n\nenade2021 O\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "14109ef5-3eb8-4c3c-9c4e-c79d93298fd4",
        "ano": "2021",
        "numero": "QUESTÃO 25",
        "conteudo": "Em conformidade com a ABNT NBR ISO/IEC 27002 (2013), segurança da informação envolve práticas\ne processos de proteção e salvaguarda dos ativos da informação e de tecnologias da informação.\nEstá amparada pelos preceitos de integridade, disponibilidade e confidencialidade. Segurança da\ninformação também pode ser entendida como uma área do conhecimento dedicada à proteção de ativos\nda informação contra acessos não autorizados e alterações indevidas. Além disso, ela aborda a proteção\nda informação contra vários tipos de ameaças, implicando na possível continuidade do negócio, na\nminimização do risco e na maximização do retorno sobre os investimentos e oportunidades.\n\nASSOCIAÇÃO BRASILEIRA DE NORMAS TÉCNICAS. ABNT NBR ISO/IEC 27002. Rio de Janeiro: ABNT, 2013 (adaptado).\n\nConsiderando o texto apresentado, avalie as afirmações a seguir.\n\nIl. A integridade da informação tem como objetivo garantir a acessibilidade da informação.\n\nIH. A disponibilidade garante que os autorizados a acessarem a informação possam fazê-lo\nsempre que necessário.\n\nHI. A confidencialidade da informação é a garantia de que somente pessoas autorizadas terão acesso\na ela, protegendo-a de acordo com o grau de sigilo do seu conteúdo.\n\nIV. A legalidade é a garantia de que a informação foi produzida em conformidade com a lei.\n\nV. A autenticidade é a garantia de que em um processo de comunicação os remetentes sejam\nexatamente quem dizem ser.\n\nÉ correto apenas o que se afirma em\n\nO el.\n\nO lei.\n\nO Ibilev.\nO il IVev.\nO Ip, IVev.\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 29\n|\n\nAM enade2021\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "a3782a15-3d74-46f5-a6c7-5fd7f61addc4",
        "ano": "2021",
        "numero": "QUESTÃO 26",
        "conteudo": "A expressão Big Data refere-se a um conjunto de técnicas e ferramentas para o armazenamento e\nmanipulação de conjuntos de dados muito grandes. Tecnologias tradicionais, como bancos de dados\nrelacionais e ferramentas de processamento sequencial, não suportam o vasto volume de dados.\nO Big Data possui quatro características marcantes: volume, variedade, velocidade e veracidade.\n\nDisponível em: https://sol.sbc.org.br/livros/index.php/sbc/catalog/. Acesso em: 13 jun. 2020 (adaptado).\n\nConsiderando as informações apresentadas e o conjunto de características marcantes do Big Data,\navalie as afirmações a seguir.\n\n|. Em relação ao volume, a quantidade de dados gerados e coletados em diversos tipos de aplicações\nestá aumentando exponencialmente, e as ferramentas de Big Data devem ser capazes de lidar\napropriadamente com esse desafio.\n\nIl. No que diz respeito à variedade, os dados podem ser coletados de diferentes fontes e com\ndiferentes formatos e estruturas e se dividem em dados estruturados, como os dados dos\ncidadãos; dados semiestruturados, como os dados de sensores; e dados não-estruturados,\ncomo os de câmeras de vídeo de segurança.\n\nIl. Quanto à velocidade, o processamento de dados deve ocorrer em condições de alta latência,\npois eles podem se tornar inúteis, como, por exemplo, dados coletados de sensores de veículos,\na análise de redes sociais e as informações sobre o trânsito da cidade.\n\nIV. No que se refere à veracidade, como os dados são coletados de múltiplas fontes, é importante\ngarantir sua qualidade, utilizando fontes confiáveis e consistentes, a fim de evitar erros e\ncomprometer as análises.\n\nÉ correto apenas o que se afirma em\n\nOlelv\n\nO ein.\nO lleiv.\nO ,lell.\nO Llelv."
    },
    {
        "id": "0b6229bc-f6d9-43a1-a2bf-bf69e0f89039",
        "ano": "2021",
        "numero": "QUESTÃO 27",
        "conteudo": "Suponha que um gestor de TI de determinada empresa está avaliando o desempenho de infraestrutura\ncom o objetivo de evitar despesas desnecessárias em aumento de capacidade. Ele identifica que o\nservidor da base de dados do sistema mais solicitado realiza uma média de 4,5 operações de I/O por\ntransação, sendo que cada |/O realizado no disco consome em média 20 ms. Em uma hora, ele observa que\n7 200 transações foram executadas.\n\nCom base nas informações apresentadas, o gestor concluiu que o throughput médio do disco\n(em transações por segundo) e a utilização média do disco (em valor percentual) são, respectivamente,\n\n02e18.\nO 2e1s.\nO9e2.\n\nO 9€e1s.\nO 15e9.\n\n30 SISTEMAS DE INFORMAÇÃO\n|\n\nenade2021\n\nExame Nacional de Desempenho dos Estudantes\n\n2720213 1%"
    },
    {
        "id": "f624af4e-e25c-4d26-8171-9e0f85c5446a",
        "ano": "2021",
        "numero": "QUESTÃO 28",
        "conteudo": "A Governança de Tecnologia da Informação pode auxiliar nos processos estratégicos das organizações,\nalinhando controles da TI, como segurança da informação e integração tecnológica, com controles\nde gestão, como marco de regulação e ambiente de negócio, conforme ilustra a figura a seguir.\n\nTi como prestadora de\n\n, Integração Tecnológica\nserviços\n\nGovernança de\nAmbientes de negócios TI\n\nSegurança da\ninformação\n\nMarcos de regulação\n\nFigura | — Fatores motivadores da Governança de Tecnologia da Informação (TI)\n\nFERNANDES, A. A; ABREU, V. F. Implantando a Governança de TI: da Estratégia à Gestão de Processos e Serviço.\nRio de Janeiro: Brasport, 2014 (adaptado).\n\nConsiderando o texto e a figura apresentados, assinale a opção correta.\nOQ Asegurança da informação é definida pela Política da Segurança da Informação, não levando em conta\ncargos e salários.\n\nO ATI como prestadora de serviços representa os profissionais de informática, não levando em conta\nhardware e software.\n\nO A integração tecnológica é definida pela integração entre hardware e software, não levando em conta\nseus fabricantes.\n\nO Os marcos de regulação são definidos pelos conselhos das organizações, não levando em conta as\nregulações políticas.\n\nO 0 ambiente de negócio é definido por clientes mais exigentes e conscientes, não levando em conta as\npolíticas internas.\n\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 31\n\nAM enade2021\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "d2467d07-8b01-4c48-b896-9c57df4b9f0f",
        "ano": "2021",
        "numero": "QUESTÃO 29",
        "conteudo": "Suponha que, como projetista de dados, você precisa desenvolver um sistema para uma clínica médica.\nApós consultar todos os envolvidos, foi proposto o seguinte modelo de entidades e relacionamentos.\n\nCodigoEspecialidade Descrição CodigoMedico\n\n(LN) (1,1)\nESPECIALIDADE MEDICO\n\nBairro\n\nodigoFuncionario\n\nAtende\naend CPF\nFUNCIONARIO\n(LN)\nCONSULTA CS\nCargo\n\n'nformaçoesMedidas\n\nCodigoConvenio) CHomeconvenia> (1,1)\nMarca\nCONVENIO (1,1) Possui <a\n\n(0,N)\n\n(0,N)\n\nCodigoPaciente\n\nTocalTrabalho)\nCodigoConveniado\n\n(0,N)\n\n>\n\n(1,1)\n\nDEPENDENTE\n\nNomeDependente\n\nTipoRelacao\n\nDataNascimento\n\nALVES, W. P. Banco de dados. São Paulo: Érica, 2014.\n\n32 SISTEMAS DE INFORMAÇÃO\n|\n\nenade2021 E\n\nExame Nacional de Desempenho dos Estudantes\n\nConsiderando esse contexto e o modelo de entidades e relacionamentos proposto, avalie as afirmações\na seguir.\n\nI. A restrição de participação da entidade MÉDICO é total, pois um médico precisa atuar em pelo\nmenos uma área da medicina; com relação à ESPECIALIDADE, a restrição é parcial, pois pode haver\nespecialidade sem nenhum médico associado.\n\nIl. A restrição de participação de PACIENTE é parcial, pois não é obrigatório o PACIENTE ter\ndependentes; já para DEPENDENTE a restrição é total, uma vez que é preciso ter um responsável\n(PACIENTE) cadastrado no banco de dados.\n\nHI. A restrição de participação de PACIENTE é parcial, já que se pode ter o cadastro do paciente no\nbanco de dados sem ter consulta marcada; já para CONSULTA a restrição é total, uma vez que uma\nconsulta somente pode ser agendada para um paciente cadastrado.\n\nIV. A razão da cardinalidade é 1:N, pois um paciente pode marcar várias consultas, em dias e horários\ndiferentes, e a consulta (em data e horário específicos) pode ser agendada para vários pacientes.\n\nÉ correto apenas o que se afirma em\n\nO lei.\nO ltelv.\nO Iltelv.\nO ,lell.\nO Llelv."
    },
    {
        "id": "6aa9b955-3954-4b2e-ab17-9a605ec30912",
        "ano": "2021",
        "numero": "QUESTÃO 30",
        "conteudo": "Um Sistema de Informação Gerencial (SIG) representa um conjunto de recursos dentre os quais é possível\ncitar os sistemas: de apoio à decisão, de especialistas, de informação executiva, de gestão de pessoas\ne de gestão de projetos, os quais permitem que a instituição funcione de forma eficiente. Os sistemas\nespecialistas são sistemas inteligentes que armazenam e processam o conhecimento adquirido de\nprofissionais especializados em uma determinada área do conhecimento.\nSPIRLANDELLI, L. P. et al. Sistemas especialistas: um estudo de caso com o EXPERT SINTA. Revista Eletrônica de Sistema\nde Informação e Gestão Tecnológica. Franca, v. 1, n. 1, p. 1-16, 2011 (adaptado).\nConsiderando o uso de um componente para um sistema especialista voltado para diagnósticos médicos,\nassinale a opção correta.\n\nOQ Base de conhecimento é o componente que mantém os axiomas gramaticais e léxicos definidos\npelos especialistas.\n\nBase de informações estratégicas é o componente que possui as técnicas de navegação nas bases\nde conhecimento.\n\nBase de regras é o componente que traduz todas as informações externas que estejam em interação\ncom o sistema especialista.\n\nAnalisador semântico é o componente que obtém e armazena informações sobre diagnósticos por\nmeio de um reconhecimento de regras gramaticais.\n\nv O OO\n\nMotor de inferência é o componente que possui um conjunto de heurísticas adotadas para a resolução\nde problemas na execução das tarefas.\n\nSISTEMAS DE INFORMAÇÃO 33\n|\n\nAM enade2021\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "35ffc3e2-31c6-48a8-9c92-7f5c8dc0e75b",
        "ano": "2021",
        "numero": "QUESTÃO 31",
        "conteudo": "Uma das finalidades da Governança de Tecnologia da Informação (TI) é monitorar o cumprimento\ndas regras de negócio estabelecidas por meio da estruturação de um catálogo de serviços, o qual\npossibilita que os serviços prestados pela gestão da TI sejam conhecidos por todos. A Governança de\nTI descreve como as pessoas envolvidas em governança em uma organização deverão considerar a TI\nno monitoramento, controle e supervisão de suas funções precípuas. Nessas condições, é reconhecido\nque a implantação ágil da Governança de TI passa pela utilização de modelos de referência, os quais\npropiciam uma governança assertiva.\n\nMORAES, E. A. P.; MARIANO, S. R. H. M. Uma releitura dos principais modelos de governança de tecnologia da informação.\nRevista das Faculdades Integradas Vianna Júnior. Juiz de Fora, v. 1, n. 1, p. 201-217, 2010. Disponível em:\nhttp://www.viannasapiens.com.br/revista/article/download/22/13/. Acesso em: 11 jun. 2020 (adaptado).\n\nEm geral, os modelos de referências (ou frameworks) de governança de TI são prescritivos, diferenciando-se\npelo tipo de enfoque e pelo nível de cobertura que oferecem à organização de TI.\n\nNesse contexto, avalie em quais modelos a instância de governança de TI define o modo como é feito o\ndirecionamento, a avaliação e o monitoramento das instâncias de gestão de TI.\n\nI. Norma ISO/IEC 38500.\n\nIl. CobiT (Control Objectives for Information and related Technology).\n\nHI. BSC (Balanced Scorecard).\n\nIv. CMMI (Capability Maturity Model Integration).\nSão modelos corretos apenas os apresentados em\n\nOle.\nO elv.\nO lei.\nO 4ileiv.\nO Ip lllelv.\n\nÁrea livre\n\n34 SISTEMAS DE INFORMAÇÃO\n|\n\nenade2021 E\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "1194932f-5f5b-4eb3-9242-9b9895719c82",
        "ano": "2021",
        "numero": "QUESTÃO 32",
        "conteudo": "No desenvolvimento do módulo de integração do sistema do SAMU com os sistemas de hospitais,\num analista gerou o seguinte diagrama de sequência.\n\nEM sd E\n' '\n\n-— 1: solicitarLeito() > wm-2: procurarLeitos()\n\n:hospitalA :hospitalB\n\n3: verificarTodos()\n\n5: procurarVaga()\n\nCom relação ao diagrama apresentado, avalie as asserções a seguir e a relação proposta entre elas.\nIl. As chamadas 4: procurarVaga() e 5: procurarVaga() são feitas simultaneamente (em paralelo) pela\nAPI para minimizar o tempo de espera da chamada 2: procurarLeitos().\nPORQUE\nIH. As chamadas 10: definirvaga() e 12: definirVaga() são feitas simultaneamente (em paralelo),\nmas a espera do retorno é feita em sequência, o que aumentará o tempo de resposta.\n\nA respeito dessas asserções, assinale a opção correta.\n\nO Asasserções le Il são proposições verdadeiras, e a Il é uma justificativa correta da |.\n\nO As asserções le Il são proposições verdadeiras, mas a Il não é uma justificativa correta da |.\nO A asserção | é uma proposição verdadeira, e a Il é uma proposição falsa.\n\nO A asserção | é uma proposição falsa, e a Il é uma proposição verdadeira.\n\nO Asasserções le Il são proposições falsas.\n\nSISTEMAS DE INFORMAÇÃO 35\n|\n\nAM enade2021\n\nExame Nacional de Desempenho dos Estudantes"
    },
    {
        "id": "fc80b4f8-c0d4-461a-81a8-7c617dd56be8",
        "ano": "2021",
        "numero": "QUESTÃO 33",
        "conteudo": "Uma abordagem calcula a posição da chave na tabela com base no valor da chave. Este valor é a única\nindicação da posição. Quando a chave é conhecida, a posição na tabela pode ser acessada diretamente,\nsem fazer qualquer outro teste preliminar, conforme exigido na busca binária ou durante a pesquisa em\numa árvore. Precisamos encontrar uma função h que possa transformar uma chave particular K — seja ela\numa cadeia de caracteres, um número, um registro etc. — em um índice na tabela usada para armazenar\nitens do mesmo tipo que K. A função h é chamada função de escrutínio (hash) e não retorna valores\núnicos. Por exemplo, A(“abc”) = h(“achb”). Este problema é chamado colisão.\n\nDROZDEK, A. Estrutura de Dados e Algoritmos em C++. São Paulo: Cengage do Brasil, p.473, 2016 (adaptado).\n\nUma tabela na qual os dados são inseridos em entradas determinadas por uma função h, conforme\ndescrito no texto, é chamada de tabela de dispersão ou tabela de espalhamento. A tabela de dispersão\né representada por meio do vetor tabelaH de T posições, no qual cada posição é uma estrutura\nItemDbado eo procedimento de inserção em tabe1aH está definido a seguir.\n\nItembado:\nChave: inteiro\nDado: inteiro\nProx: Itembado\nprocedimento insere (chave, dado: inteiro)\ninício\nitem, temp: ItemDado\níndice: inteiro\níndice <- h(chave)\nse tabelaH[índice].chave = -1 então\ntabelaH[índice].chave <- chave\ntabelaH [índice] .dado <- dado\ntabelaH[índice].prox <- NULO\nsenão\nitem.chave <- chave\nitem.dado <- dado\nitem.prox <- NULO\nse tabelaH[índice] .prox = NULO então\ntabelaH[índice].prox <- item\nsenão\ntemp <- tabelaH[índice] .prox\nenquanto temp.prox % NULO faça\ntemp <- temp.prox\nfimenquanto\ntemp.prox <- item\nfimse\nfimse\nfimprocedimento\n\nO valor -1 no campo chave de uma entrada na tabela significa que aquela entrada está livre; o campo\nProx com o valor NULO significa que ele não aponta para nenhum item de dado. A função h (chave)\nsimplesmente retorna o valor do resto da divisão inteira de chave por T.\n\nConsiderando as informações apresentadas e supondo que T = 9, assinale a opção que corresponde ao\nestado de tabe1aH após a seguinte sequência de chamadas: insere(13, 6); insere(46, 7); insere(20, 22);\ninsere(28, 25); insere(19, 26); insere(17, 9).\n\n36 SISTEMAS DE INFORMAÇÃO\n\no auUswnmnHo os auUswnmnNHo os auUswnmnNHo os auUswnmnNHo\n\no auUswnNHo\n\nenade2021\n\nExame Nacional de Desempenho dos Estudantes\n\n* R2 720213 7%\n\n1 | - | nuLo\n\n46 | 7 |6-—1-»/ 28] 25 [6 15 | 26 | NULO\n20 | 22 | NULO\n\n1 | - | NULO\n\n16 | 6 | NULO\n\n1 | - | NULO\n\n4 NULO\n\n4 NULO\n\n4 NULO\n\n17 | 9 | NULO\n\nal- le ls 46|7/]/06—»22]25 [61/49 | 26 |nuto\n13 | 6 | NULO\n\n1 | - | NULO\n\n4 NULO\n\n4 NULO\n\n20 | 22 | NULO\n\n4 NULO\n\n4 NULO\n\na | - | nuto\n\n46 | 7\n\n20 | 22\n\n1 | - | NULO\n\n13 | 6 | NULO\n\n28 | 25\n\n19 | 26 | NULO\n\n1 | - | NULO\n\n17 | 9 | NULO\n\na | - | nuLo\n\n46 | 7 | NULO\n\n20 | 22 | NULO\n\n28 | 25 | NULO\n\n13 | 6 | NULO\n\n19 | 26 | NULO\n\n4 NULO\n\n1 | - | NULO\n\n17 | 9 | NULO\n\n4\n\ne 46 | 1 |[6-——»/ 28 [25 [6———» 19 | 26 | nuto\nes 20 | 22 |nuio\n4\n\ne— > 13 | 6 |nuto\n4\n\n4\n\n4\n\noe» 17 | 9 |nuio\n\nSISTEMAS DE INFORMAÇÃO\n\n37"
    },
    {
        "id": "80da8a8c-ac03-4e3d-babd-1f182066e3fd",
        "ano": "2021",
        "numero": "QUESTÃO 34",
        "conteudo": "MO enade2021\n\nExame Nacional de Desempenho dos Estudantes\n\nCom o crescimento da população urbana, problemas de infraestrutura e de acesso limitado a recursos\nem diversas cidades ao redor do mundo afetam negativamente a vida de bilhões de pessoas. Tornar as\ncidades mais inteligentes pode ajudar a melhorar os serviços urbanos, aumentando a qualidade de vida\nde seus cidadãos. As Tecnologias da Informação e Comunicação (TIC) propiciam meios fundamentais\npara viabilizar essa mudança, entretanto, ainda existem desafios científicos e técnicos significativos que\nnecessitam ser enfrentados antes que essas plataformas possam ser amplamente utilizadas.\n\nConsiderando as informações apresentadas, avalie as afirmações a seguir.\n\nUma forma de enfrentar o problema da infraestrutura é tornar as cidades mais inteligentes e,\npara atingir esse objetivo, as TIC podem ser empregadas para coletar e analisar uma grande\nquantidade de informações geradas por diversas fontes de dados da cidade, como, por exemplo:\nredes de sensores, sistemas de trânsito e dispositivos dos cidadãos.\n\nUma dificuldade que ocorre na maioria das aplicações de cidades inteligentes é que, geralmente,\nos sistemas são direcionados a um problema específico e são desenvolvidos desde o início com\npouco reuso de software e sem a comunicação entre eles, o que gera maior trabalho e dificuldade\nna criação de aplicações que necessitem de dados e serviços de diversos domínios.\n\nEntre os maiores desafios no desenvolvimento de aplicações para cidades inteligentes estão\na garantia da privacidade e da segurança dos cidadãos, o gerenciamento do armazenamento\ne do processamento de grandes quantidades de dados, além da heterogeneidade de\ndispositivos existentes.\n\nA Internet das Coisas (Internet of Things - loT) faz uso de tecnologias e protocolos proprietários\npara conexão de objetos do cotidiano, tais como lâmpadas para iluminação pública, semáforos\nde trânsito e sensores de qualidade de água e ar, sendo que os objetos devem ser identificados\ncom um nome único, sua posição e estado conhecidos, e devem ser acessíveis por meio de\nredes móveis.\n\nÉ correto apenas o que se afirma em\n\nOle.\n\nO ein.\n\nO Iltelv.\n\nO ,lell.\n\nO Llelv.\n\nÁrea livre\n\n38 SISTEMAS DE INFORMAÇÃO\n\nenade2021\n\nExame Nacional de Desempenho dos Estudantes\n\n2720213 9%"
    },
    {
        "id": "7d96b343-5ae3-41cc-84a8-dcc8ec514ca1",
        "ano": "2021",
        "numero": "QUESTÃO 35",
        "conteudo": "A legibilidade diz respeito às características que possam dificultar ou facilitar a leitura das informações\ntextuais, como, por exemplo: brilho do caractere, contraste letra/fundo, tamanho da fonte, espaçamento\nentre palavras, espaçamento entre linhas, espaçamento de parágrafos, comprimento da linha,\nentre outros.\n\nCYBIS, W.; BETIOL, A. H.; FAUST, R. Ergonomia e Usabilidade: Conhecimentos, Métodos e Aplicações.\n2. ed. São Paulo: Novatec Editora Ltda. 2010 (adaptado).\n\nAcerca das características e importância da legibilidade, avalie as afirmações a seguir.\n\n|. Em uma interface legível, o texto longo deve ser lido rapidamente e deve aparecer em letras\nmaiúsculas e minúsculas misturadas naturalmente, com maiúsculas no início de frases e\nnomes próprios.\n\nIl. Os textos longos devem ser apresentados em linhas com menor comprimento possível e com o\nmínimo contraste efetivo com o fundo.\n\nHI. O texto que deve ser lido por idosos ou pessoas com problemas de visão aparece em letras claras\nsobre um fundo escuro, pois, para esse público, o fundo brilhante pode ofuscar completamente\nas letras escuras.\n\nÉ correto o que se afirma em\n\nQ Il, apenas.\n\nO Ill, apenas.\nO lell, apenas.\nO lelll, apenas.\nO Llell.\n\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 39\n|\n\n* R2 720214 0%\n\nenade2021\n\nExame Nacional de Desempenho dos Estudantes\n\nQUESTIONÁRIO DE PERCEPÇÃO DA PROVA\n\nAs questões abaixo visam conhecer sua opinião sobre a qualidade e a adequação da prova que você acabou de realizar.\nAssinale as alternativas correspondentes à sua opinião nos espaços apropriados do CARTÃO-RESPOSTA."
    }
]