[
    {
        "id": "8ad9854c-8beb-4624-a487-ce6ab65abd0d",
        "ano": "2017",
        "numero": "QUESTÃO 01",
        "conteudo": "Os britânicos decidiram sair da União Europeia (UE). A decisão do referendo abalou os mercados\nfinanceiros em meio às incertezas sobre os possíveis impactos dessa saída.\n\nOs gráficos a seguir apresentam, respectivamente, as contribuições dos países integrantes do bloco\npara a UE, em 2014, que somam £€ 144,9 bilhões de euros, e a comparação entre a contribuição do\nReino Unido para a UE e a contrapartida dos gastos da UE com o Reino Unido.\n\nContribuições para a UE Reino Unido e UE\nDados de 2014, em € bilhões Dados de 2014, em € bilhões\n50 15\n\n42,1 11,3\n\nPN\nto\nUn\n\ntw\n[o\n\nFrança\n.:\nItália o\n\nÁustria EM\nDinamarca\n\nAlemanha\n\nReino Unido [DA +\nto\nEspanha HH 5\n[2]\nHolanda [HH\nx (2)\nSuécia Hj\n(28)\nBélgica HS,\nA (88)\nPolônia HH,\nLx\n[00]\nMM\nMm\n\n40 10\n6,9\n30 5\n25,8\n20 0\n10\n| Contribuição do Reino Unido com a UE\n0 E Gasto da UE com o Reino Unido\nã “o\no\nQ\ne\n5\n=)\n(o)\n\nDisponível em: <http://www.g1.globo.com>. Acesso em: 6 set. 2017 (adaptado).\n\nConsiderando o texto e as informações apresentadas nos gráficos acima, assinale a opção correta.\n\nOQ A contribuição dos quatro maiores países do bloco somou 41,13%.\n\nO Ogrupo “Outros países” contribuiu para esse bloco econômico com 42,1%.\n\nO A diferença da contribuição do Reino Unido em relação ao recebido do bloco econômico foi 38,94%.\nO Asoma das participações dos três países com maior contribuição para o bloco econômico supera 50%.\n\nO O percentual de participação do Reino Unido com o bloco econômico em 2014 foi de 17,8%, o que o\n\ncolocou entre os quatro maiores participantes.\n\nSISTEMAS DE INFORMAÇÃO 5\n\n2017\nEEN enade\n\nExame Nacional de Desempenho\ndos Estudantes"
    },
    {
        "id": "9daa08de-f1cc-4504-a90a-62edea24bff1",
        "ano": "2017",
        "numero": "QUESTÃO 02",
        "conteudo": "Segundo o relatório da Organização das Nações Unidas para a Alimentação e a Agricultura de 2014,\na agricultura familiar produz cerca de 80% dos alimentos no mundo e é guardiã de aproximadamente 75%\nde todos os recursos agrícolas do planeta. Nesse sentido, a agricultura familiar é fundamental para a\nmelhoria da sustentabilidade ecológica.\n\nDisponível em: <http://www.fao.org>. Acesso em: 29 ago. 2017 (adaptado).\nConsiderando as informações apresentadas no texto, avalie as afirmações a seguir.\n\nIl. Os principais desafios da agricultura familiar estão relacionados à segurança alimentar,\nà sustentabilidade ambiental e à capacidade produtiva.\n\nIH. As políticas públicas para o desenvolvimento da agricultura familiar devem fomentar a\ninovação, respeitando o tamanho das propriedades, as tecnologias utilizadas, a integração\nde mercados e as configurações ecológicas.\n\nHI. A maioria das propriedades agrícolas no mundo tem caráter familiar, entretanto o trabalho\nrealizado nessas propriedades é majoritariamente resultante da contratação de mão de\nobra assalariada.\n\nÉ correto o que se afirma em\n\nO | apenas.\n\nO Ill, apenas.\n\nO lell, apenas.\nO lei, apenas.\n\nO Liell.\nÁrea livre\n6 SISTEMAS DE INFORMAÇÃO\n\n2017\nenade E\n\nExame Nacional de Desempenho\ndos Estudantes"
    },
    {
        "id": "02640304-ad58-4b43-8e76-94a72217104a",
        "ano": "2017",
        "numero": "QUESTÃO 03",
        "conteudo": "O sistema de tarifação de energia elétrica funciona com base em três bandeiras. Na bandeira verde,\nas condições de geração de energia são favoráveis e a tarifa não sofre acréscimo. Na bandeira amarela,\na tarifa sofre acréscimo de R$ 0,020 para cada kWh consumido, e na bandeira vermelha, condição de\nmaior custo de geração de energia, a tarifa sofre acréscimo de R$ 0,035 para cada kWh consumido. Assim,\npara saber o quanto se gasta com o consumo de energia de cada aparelho, basta multiplicar o consumo\nem kWh do aparelho pela tarifa em questão.\n\nDisponível em: <http://www.aneel.gov.br>. Acesso em: 17 jul. 2017 (adaptado).\n\nNa tabela a seguir, são apresentadas a potência e o tempo de uso diário de alguns aparelhos\neletroeletrônicos usuais em residências.\n\nPotência Tempo de uso\n\nAparelho (KW) diário (h) kwh\nCarregador de celular 0,010 24 0,240\nChuveiro 3 500 W 3,500 0,5 1,750\nChuveiro 5 500 W 5,500 0,5 2,250\nLâmpada de LED 0,008 5 0,040\nLâmpada fluorescente 0,015 5 0,075\nLâmpada incandescente 0,060 5 0,300\nModem de internet em stand-by 0,005 24 0,120\nModem de internet em uso 0,012 8 0,096\n\nDisponível em: <https://www.educandoseubolso.blog.br>. Acesso em: 17 jul. 2017 (adaptado).\nConsiderando as informações do texto, os dados apresentados na tabela, uma tarifa de R$ 0,50 por kWh\nem bandeira verde e um mês de 30 dias, avalie as afirmações a seguir.\n|. Em bandeira amarela, o valor mensal da tarifa de energia elétrica para um chuveiro de 3 500 W\nseria de R$ 1,05, e de R$ 1,65, para um chuveiro de 5 500 W.\n\nIl. Deixar um carregador de celular e um modem de internet em stand-by conectados na rede de\nenergia durante 24 horas representa um gasto mensal de R$ 5,40 na tarifa de energia elétrica em\nbandeira verde, e de R$ 5,78, em bandeira amarela.\n\nIll. Em bandeira verde, o consumidor gastaria mensalmente R$ 3,90 a mais na tarifa de energia elétrica\nem relação a cada lâmpada incandescente usada no lugar de uma lâmpada LED.\nÉ correto o que se afirma em\nQ Il, apenas.\nO Ill, apenas.\nO lell, apenas.\n\nO tell, apenas.\nO Lie.\n\nSISTEMAS DE INFORMAÇÃO 7\n\n2017\nEEN enade\n\nExame Nacional de Desempenho\ndos Estudantes"
    },
    {
        "id": "e62bc22b-5f14-48c6-ac1e-d8b55cbb02bd",
        "ano": "2017",
        "numero": "QUESTÃO 04",
        "conteudo": "Sobre a televisão, considere a tirinha e o texto a seguir.\n\nTEXTO 1\nEU ACHO O PERÍODO A MEU VER, SE ALGO É TÃO | O MEU TEMPO E VALIOSO, EU\nCURTO DE ATENÇÃO DA COMPLICADO QUE NÃO SE NÃO POSSO FICAR PENSANDO\nTELEVISÃO ÓTIMO! PODE EXPLICAR EM DEZ NUM ASSUNTO POR MINUTOS\nSEGUNDOS, PROVAVELMENTE | DE UMA pg ALGUEM\nNÃO VALE MESMO A PENA hs\nSABER.\nN aM,\nN\nÉc y\nEs\no\n\nDisponível em: <https://www.coletivando files.wordpress.com>. Acesso em: 25 jul. 2015.\nTEXTO 2\nA televisão é este contínuo de imagens, em que o telejornal se confunde com o anúncio de pasta de\ndentes, que é semelhante à novela, que se mistura com a transmissão de futebol. Os programas mal\nse distinguem uns dos outros. O espetáculo consiste na própria sequência, cada vez mais vertiginosa,\nde imagens.\n\nPEIXOTO, N. B. As imagens de TV têm tempo? In: NOVAES, A. Rede imaginária: televisão e democracia.\nSão Paulo: Companhia das Letras, 1991 (adaptado).\n\nCom base nos textos 1 e 2, é correto afirmar que o tempo de recepção típico da televisão como veículo\nde comunicação estimula a\n\nOQ contemplação das imagens animadas como meio de reflexão acerca do estado de coisas no mundo\ncontemporâneo, traduzido em forma de espetáculo.\n\nO fragmentação e o excesso de informação, que evidenciam a opacidade do mundo contemporâneo,\ncada vez mais impregnado de imagens e informações superficiais.\n\nO especialização do conhecimento, com vistas a promover uma difusão de valores e princípios amplos,\ncom espaço garantido para a diferença cultural como capital simbólico valorizado.\n\nO atenção concentrada do telespectador em determinado assunto, uma vez que os recursos expressivos\npróprios do meio garantem a motivação necessária para o foco em determinado assunto.\n\nO reflexão crítica do telespectador, uma vez que permite o acesso a uma sequência de assuntos de\ninteresse público que são apresentados de forma justaposta, o que permite o estabelecimento\nde comparações.\n\nÁrea livre\n\n8 SISTEMAS DE INFORMAÇÃO\n\n2017\nenade m\n\nExame Nacional de Desempenho\ndos Estudantes\n\nR\n\n4020179 %"
    },
    {
        "id": "2a9d9517-ee15-412e-8442-be25ec62637f",
        "ano": "2017",
        "numero": "QUESTÃO 05",
        "conteudo": "Hidrogéis são materiais poliméricos em forma de pó, grão ou fragmentos semelhantes a pedaços de\nplástico maleável. Surgiram nos anos 1950, nos Estados Unidos da América e, desde então, têm sido\nusados na agricultura. Os hidrogéis ou polímeros hidrorretentores podem ser criados a partir de\npolímeros naturais ou sintetizados em laboratório. Os estudos com polímeros naturais mostram\nque eles são viáveis ecologicamente, mas ainda não comercialmente.\n\nNo infográfico abaixo, explica-se como os polímeros naturais superabsorventes, quando misturados ao\nsolo, podem viabilizar culturas agrícolas em regiões áridas.\n\nPor dentro dos hidrogéis\nSaiba como funcionam os polímeros superabsorventes que ajudam a reter no solo,\npor mais tempo, a água da chuva ou da irrigação.\n\nHidratado .\nO Quando hidratados, € Os modelos comerciais O Nahora do plantio, o O Quando a lavoura é VANTAGENS DO HIDROGEL\n\neles absorvem a água são feitos de poliacrilatos, hidrogel, ainda seco, é hidratada, pela chuva O hidrogel permite o cultivo\n\ne adquirem uma um derivado da acrilamida, misturado ao solo onde ou pela irrigação, o polimero em regiões áridas: COM DONcE\n\nconsistência esponjasa composto sintetizado em será colocada a muda absorve o liquido e passa a ibid dec ear\n\nougelatinasa. laboratório. ou semente. No Brasi, liberá-lo gradualmente. Er E a\na tecnologia é usada As raizes da planta retiram reduz a frequência da Irrigação.\nprincipalmente em florestas à água do gel, da mesma Além disso, diminui a chance\nde eucalipto, mas estudos o up de mudas morrerem em\ncomprovaram sua o solo,\n\nfunção da estiagem e favorece\n\nviabilidade na cafeicultura.\n\no crescimento das plantas.\n\nDisponível em: <http://www.revistapesquisa.fapesp.br>. Acesso em: 18 jul. 2017 (adaptado).\n\nA partir das informações apresentadas, assinale a opção correta.\n\nOQ O uso do hidrogel, em caso de estiagem, propicia a mortalidade dos pés de café.\n\nO O hidrogel criado a partir de polímeros naturais deve ter seu uso restrito a solos áridos.\n\nO Os hidrogéis são usados em culturas agrícolas e florestais e em diferentes tipos de solos.\n\nO O uso de hidrogéis naturais é economicamente viável em lavouras tradicionais de larga escala.\n\nO O uso dos hidrogéis permite que as plantas sobrevivam sem a água da irrigação ou das chuvas.\n\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 9"
    },
    {
        "id": "f84d3050-947b-42db-9014-0ccc1223bd00",
        "ano": "2017",
        "numero": "QUESTÃO 06",
        "conteudo": "2017\nEE enade\n\nExame Nacional de Desempenho\ndos Estudantes\n\nR 4\n\nA imigração haitiana para o Brasil passou a ter grande repercussão na imprensa a partir de 2010.\nDevido ao pior terremoto do país, muitos haitianos redescobriram o Brasil como rota alternativa\npara migração. O país já havia sido uma alternativa para os haitianos desde 2004, e isso se deve à\nreorientação da política externa nacional para alcançar liderança regional nos assuntos humanitários.\n\nA descoberta e a preferência pelo Brasil também sofreram influência da presença do exército\nbrasileiro no Haiti, que intensificou a relação de proximidade entre brasileiros e haitianos. Em meio\na esse clima amistoso, os haitianos presumiram que seriam bem acolhidos em uma possível migração\nao país que passara a liderar a missão da ONU.\n\nNo entanto, os imigrantes haitianos têm sofrido ataques xenofóbicos por parte da população\nbrasileira. Recentemente, uma das grandes cidades brasileiras serviu como palco para uma marcha\nanti-imigração, com demonstrações de um crescente discurso de ódio em relação a povos imigrantes\nmarginalizados.\n\nObserva-se, na maneira como esses discursos se conformam, que a reação de uma parcela dos\nbrasileiros aos imigrantes se dá em termos bem específicos: os que sofrem com a violência dos atos\nde xenofobia, em geral, são negros e têm origem em países mais pobres.\n\nSILVA, C. A. S.; MORAES, M. T. A política migratória brasileira para refugiados e a imigração haitiana. Revista do Direito.\nSanta Cruz do Sul, v. 3, n. 50, p. 98-117, set./dez. 2016 (adaptado).\n\nA partir das informações do texto, conclui-se que\n\nO o processo de acolhimento dos imigrantes haitianos tem sido pautado por características fortemente\nassociadas ao povo brasileiro: a solidariedade e o respeito às diferenças.\n\nO as reações xenófobas estão relacionadas ao fato de que os imigrantes são concorrentes diretos\npara os postos de trabalho de maior prestígio na sociedade, aumentando a disputa por boas\nvagas de emprego.\n\nO o acolhimento promovido pelos brasileiros aos imigrantes oriundos de países do leste europeu tende\na ser semelhante ao oferecido aos imigrantes haitianos, pois no Brasil vigora a ideia de democracia\nracial e do respeito às etnias.\n\nO o nacionalismo exacerbado de classes sociais mais favorecidas, no Brasil, motiva a rejeição aos\nimigrantes haitianos e a perseguição contra os brasileiros que pretendem morar fora do seu país em\nbusca de melhores condições de vida.\n\nO a crescente onda de xenofobia que vem se destacando no Brasil evidencia que o preconceito e a\nrejeição por parte dos brasileiros em relação aos imigrantes haitianos é pautada pela discriminação\nsocial e pelo racismo.\n\nÁrea livre\n\n10 SISTEMAS DE INFORMAÇÃO\n\n2017\nenade A\n\nExame Nacional de Desempenho\ndos Estudantes"
    },
    {
        "id": "49477467-ea66-4dd6-8986-d5037d386e54",
        "ano": "2017",
        "numero": "QUESTÃO 07",
        "conteudo": "A produção artesanal de panela de barro é uma das maiores expressões da cultura popular do\nEspírito Santo. A técnica de produção pouco mudou em mais de 400 anos, desde quando a panela\nde barro era produzida em comunidades indígenas. Atualmente, apresenta-se com modelagem\nprópria e original, adaptada às necessidades funcionais da culinária típica da região. As artesãs,\nvinculadas à Associação das Paneleiras de Goiabeiras, do município de Vitória-ES, trabalham em\num galpão com cabines individuais preparadas para a realização de todas as etapas de produção.\nPara fazer as panelas, as artesãs retiram a argila do Vale do Mulembá e do manguezal que margeia\na região e coletam a casca da Rhysophora mangle, popularmente chamada de mangue vermelho.\nDa casca dessa planta as artesãs retiram a tintura impermeabilizante com a qual açoitam as\npanelas ainda quentes. Por tradição, as autênticas moqueca e torta capixabas, dois pratos típicos\nregionais, devem ser servidas nas panelas de barro assim produzidas. Essa fusão entre as panelas\nde barro e os pratos preparados com frutos do mar, principalmente a moqueca, pelo menos no\nestado do Espírito Santo, faz parte das tradições deixadas pelas comunidades indígenas.\n\nDisponível em: <http://www.vitoria.es.gov.br>. Acesso em: 14 jul. 2017 (adaptado).\n\nComo principal elemento cultural na elaboração de pratos típicos da cultura capixaba, a panela de\nbarro de Goiabeiras foi tombada, em 2002, tornando-se a primeira indicação geográfica brasileira\nna área do artesanato, considerada bem imaterial, registrado e protegido no Instituto do Patrimônio\nHistórico e Artístico Nacional (Iphan), no Livro de Registro dos Saberes e declarada patrimônio cultural\ndo Brasil.\n\nSILVA, A. Comunidade tradicional, práticas coletivas e reconhecimento: narrativas contemporâneas do patrimônio cultural.\n\n40º Encontro Anual da Anpocs. Caxambu, 2016 (adaptado).\n\nAtualmente, o trabalho foi profissionalizado e a concorrência para atender ao mercado ficou mais acirrada,\n\na produção que se desenvolve no galpão ganhou um ritmo mais empresarial com maior visibilidade\n\npublicitária, enquanto as paneleiras de fundo de quintal se queixam de ficarem ofuscadas comercialmente\ndepois que o galpão ganhou notoriedade.\n\nMERLO, P. Repensando a tradição: a moqueca capixaba e a construção da identidade local.\nInterseções. Rio de Janeiro. v. 13, n. 1, 2011 (adaptado).\n\nCom base nas informações apresentadas, assinale a alternativa correta.\n\nOQ A produção das panelas de barro abrange interrelações com a natureza local, de onde se extrai a\nmatéria-prima indispensável à confecção das peças ceramistas.\n\nO A relação entre as tradições das panelas de barro e o prato típico da culinária indígena permanece\ninalterada, o que viabiliza a manutenção da identidade cultural capixaba.\n\nO A demanda por bens culturais produzidos por comunidades tradicionais insere o ofício das paneleiras no\nmercado comercial, com retornos positivos para toda a comunidade.\n\nO Ainserção das panelas de barro no mercado turístico reduz a dimensão histórica, cultural e estética do\nofício das paneleiras à dimensão econômica da comercialização de produtos artesanais.\n\nO O ofício das paneleiras representa uma forma de resistência sociocultural da comunidade tradicional\nna medida em que o estado do Espírito Santo mantém-se alheio aos modos de produção, divulgação e\ncomercialização dos produtos.\n\nSISTEMAS DE INFORMAÇÃO 11\n\n2017\nAEE enade\n\nExame Nacional de Desempenho\nlos Estudantes"
    },
    {
        "id": "fb17eb39-f7ed-4cd6-8a82-b11640e9b8d1",
        "ano": "2017",
        "numero": "QUESTÃO 08",
        "conteudo": "Os Objetivos de Desenvolvimento Sustentável (ODS) compõem uma agenda mundial adotada\ndurante a Cúpula das Nações Unidas sobre o Desenvolvimento Sustentável, em setembro de 2015.\nNessa agenda, representada na figura a seguir, são previstas ações em diversas áreas para o\nestabelecimento de parcerias, grupos e redes que favoreçam o cumprimento desses objetivos.\n\n9 INDÚSTRIA\nmova\n\n[Ú\nDERALETRITURA\n\nERRADICAÇÃO É BIA SAE\nDAPOBRETA IMUNIDADE EOEM ESTAR\n\nBIOSFERA\n\n15 ra\n\nVIDA CERA\nTUA\n\nv\nDisponível em: <http://www.stockholmresilience.org>. Acesso em: 26 set. 2017 (adaptado).\nConsiderando que os ODS devem ser implementados por meio de ações que integrem a economia,\na sociedade e a biosfera, avalie as afirmações a seguir.\n\nI. O capital humano deve ser capacitado para atender às demandas por pesquisa e inovação em\náreas estratégicas para o desenvolvimento sustentável.\n\nIl. A padronização cultural dinamiza a difusão do conhecimento científico e tecnológico entre as\nnações para a promoção do desenvolvimento sustentável.\n\nII. Os países devem incentivar políticas de desenvolvimento do empreendedorismo e de atividades\nprodutivas com geração de empregos que garantam a dignidade da pessoa humana.\nÉ correto o que se afirma em\nO Ij, apenas.\nOQ Ill, apenas.\nO le, apenas.\nO lell, apenas.\nO Lllell.\n\n12 SISTEMAS DE INFORMAÇÃO\n\n2017\nenade A\n\nExame Nacional de Desempenho\ndos Estudantes\n\nCOMPONENTE ESPECÍFICO\n\nQUESTÃO DISCURSIVA 03\n\nUma Instituição de Educação Superior (IES) está construindo seu novo Planejamento Estratégico de\nTecnologia da Informação (PETI) e contratou um diretor de TI para conceber e executar um projeto de\ntransformação digital na instituição, considerada como um pré-requisito para a construção do PETI.\n\nA IES ainda não possui uma estratégia clara de negócio frente à nova dinâmica de mercado e seu corpo\nde diretores acredita que todos os serviços, inclusive os de TI, devam estar centralizados na própria\ninstituição. Analisando a estrutura da IES, o diretor de TI percebeu que ainda não existia um setor\nespecífico para atividades relacionadas ao marketing digital da instituição. Sugeriu, assim, a terceirização\nde todos os serviços relacionados a essa atividade e, com isso, a descentralização de alguns serviços de TI.\nEssa iniciativa gerou desconforto entre os diretores da IES, que prontamente convocaram uma reunião\npara que esse diretor esclarecesse os motivos que o levaram a sugerir a terceirização das atividades e dos\nserviços do novo setor.\n\nConsiderando essa situação, apresente, na condição de diretor de TI, argumentos para convencer os\ndemais diretores de que a sua sugestão é a mais adequada frente às mudanças do mercado. Em seu texto,\naborde os seguintes aspectos:\n\ne as atividades relacionadas à Governança de TI que podem ser aplicadas na IES;\n\ne os aspectos organizacionais a serem considerados para a tomada de decisão na elaboração\ndo PETI.\n\n(valor: 10,0 pontos)\n\nRASCUNHO\n1\n\n2\n\n3\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 13\n\n2017\nEE enade\n\nExame Nacional de Desempenho\ndos Estudantes\n\nQUESTÃO DISCURSIVA 04\n\nA figura a seguir representa uma plantação de café com x colunas e y linhas. Nessa figura, as regiões com\nos cafeeiros plantados são as que estão com os espaços preenchidos, e as regiões com falhas de plantios\nsão as que apresentam seus espaços vazios.\n\nConsiderando uma solução algorítmica para contar a quantidade de falhas de plantio do cafezal\nrepresentado na figura, faça o que se pede nos itens a seguir.\n\na) Indique otipo de estrutura de dados utilizada na solução, justificando a sua resposta. (valor: 4,0 pontos)\n\nb) Escreva o algoritmo da solução em pseudocódigo ou em linguagem de programação. (valor: 6,0 pontos)\n\nRASCUNHO\n1\n\n2\n\n3\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\nÁrea livre\n\n14 SISTEMAS DE INFORMAÇÃO\n\n2017\nenade AA\n\nExame Nacional de Desempenho\ndos Estudantes\n\nQUESTÃO DISCURSIVA 05\n\nDurante as Olimpíadas de 2016, foram disputadas nove competições masculinas e seis competições\nfemininas de tiro esportivo. Para os Jogos Olímpicos de 2020, propõe-se o desenvolvimento de um\nsistema de agendamento de competições de tiro esportivo, com base nas competições realizadas nos\núltimos jogos.\n\nNo tiro esportivo, cada competição é composta por eventos, que podem ser a fase classificatória, a fase\nfinal ou a cerimônia de entrega de medalhas. Para cada evento, é preciso saber a data de realização, o\nhorário de início, o horário estimado de término e o local, que pode ser uma das diversas salas de tiro\nou o campo de tiro externo, destinado às competições de fossa olímpica e skeet. As competições se\ndiferenciam em função de três características:\n\ne o equipamento utilizado, que pode ser pistola, carabina ou espingarda;\n\ne otipo de alvo e a distância, que pode ser um alvo fixo em distâncias de 10 m, 25 m ou 50 m ou\npratos lançados que devem ser atingidos no ar;\n\ne a posição do atirador ao disparar, que pode ser deitado, ajoelhado ou em pé.\n\nAs competições de tiro esportivo realizadas nos últimos Jogos Olímpicos de 2016 estão apresentadas no\nquadro a seguir.\n\nCompetições masculinas Competições femininas\nPistola de ar 10 m Pistola de ar 10 m\nCarabina de ar 10m Carabina de ar 10m\n\nPistola rápida 25 m Pistola 25 m\nPistola 50 m Carabina três posições 50 m\nCarabina deitado 50 m Skeet\nCarabina três posições 50 m Fossa olímpica\nSkeet\nFossa olímpica\nFossa olímpica dupla\n\nAs competições dessa modalidade contam com atletas de diversos países, sendo que cada atleta pode\nparticipar de uma ou mais competições, desde que esteja devidamente classificado. Para cada atleta, é\npreciso registrar o nome, o país e o comitê olímpico nacional que representa, além das competições que\nirá disputar.\n\nConsiderando o domínio apresentado no texto, elabore um diagrama de classe da UML para esse sistema,\n\nidentificando as classes (no máximo seis), os atributos e os relacionamentos. (valor: 10,0 pontos)\n\nSISTEMAS DE INFORMAÇÃO 15\n\n2017\nEEN enade\n\nExame Nacional de Desempenho\ndos Estudantes\n\nRASCUNHO\n\nÁrea livre\n\n16 SISTEMAS DE INFORMAÇÃO\n\nenade\n\nExame Nacional de Desempenho\n\n* R4 0201717 *\n\ndos Estudantes"
    },
    {
        "id": "cf811fd3-89c6-451f-aecb-31f6d25e875f",
        "ano": "2017",
        "numero": "QUESTÃO 09",
        "conteudo": "Na fase de levantamento de requisitos do processo\nde desenvolvimento de software, devem-se\nidentificar as regras de negócio, os requisitos\nfuncionais e os requisitos não funcionais do sistema.\n\nConsiderando um cenário em que um vendedor de\nsorvetes tenha o objetivo de gerenciar suas vendas\ncom o uso de um aplicativo, avalie os itens a seguir.\n\nIl. Regra de negócio: entregar o sorvete ao\ncliente somente mediante pagamento;\nrequisito funcional: reabastecer o estoque\nquando a quantidade de sorvetes atingir o\nmínimo; requisito não funcional: especificar\no tempo de resposta do aplicativo.\n\nIl. Regra de negócio: aplicar promoções\nvigentes na realização da venda; requisito\nfuncional: calcular a quantidade de sorvetes\nna estoque; requisito não funcional: exibir\nrelatório com o balanço de vendas.\n\nIl. Regra de negócio: aceitar somente\npagamentos com cartão de débito ou"
    },
    {
        "id": "617020e1-ccf3-4ebf-902e-1c1244885116",
        "ano": "2017",
        "numero": "QUESTÃO 10",
        "conteudo": "O Guia do Conhecimento em Gerenciamento\nde Projetos (Project Management Body of\nKnowledge - PMBOK) inclui o gerenciamento de\nriscos como uma das áreas de conhecimento que\ndevem ser observadas para o sucesso do projeto.\nOs riscos identificados são analisados em função da\nprobabilidade de sua ocorrência e do impacto que\ncausarão ao projeto, caso ocorram.\n\nA respeito da definição de risco em um projeto, de\nacordo com as orientações do PMBOK, avalie as\nafirmações a seguir.\n|. Osriscos em um projeto podem ocorrer com\nprobabilidade entre O e 100%.\nIl. O impacto do risco, caso ocorra, pode ser\npositivo ou negativo.\nIll. Devem ser desconsiderados os riscos que\nnão afetam o objetivo do projeto.\n\nIV. O valor estimado referente ao impacto deve\nser diferente de zero.\n\nÉ correto apenas o que se afirma em\n\ncrédito; requisito funcional: consultar\na quantidade de vendas; requisito não | Q lei.\nfuncional: - verificar a possibilidade de O ev.\nindisponibilidade do sistema. O lei\nev.\nIv. Regra de negócio: conceder aos clientes\nO Lite.\nque comprarem 2 sorvetes um desconto de\n10%; requisito funcional: processar a venda O IL lltelv.\ndo sorvete; requisito não funcional: verificar | Área livre\no tempo gasto com o treinamento para a\nutilização do aplicativo.\nÉ correto apenas o que se descreve em\nQ ler.\nO ein.\nO lei.\nO Lielv.\nO Lilelv.\nÁrea livre\nSISTEMAS DE INFORMAÇÃO 17\n\n2017\nEE enade"
    },
    {
        "id": "12b3c18c-10d4-41ba-9deb-a390d50d31e2",
        "ano": "2017",
        "numero": "QUESTÃO 11",
        "conteudo": "O diagrama Entidade-Relacionamento (DER) a seguir apresenta a modelagem conceitual de dados de\num sistema de informação para um museu. A partir dessa modelagem observa-se o seguinte: uma Obra\né criada por um único Artista e um Artista pode criar no mínimo uma Obra e no máximo várias Obras; as\nentidades Pintura e Escultura são especializações da entidade Obra; um Artista tem o domínio de várias\n\nExame Nacional de Desempenho\ndos Estudantes\n\nTécnicas, assim como uma Técnica é dominada por diversos Artistas.\n\nCom base nas regras de mapeamento que transformam o Modelo Conceitutal em um Modelo Lógico\nRelacional, avalie as afirmações a seguir, a respeito do Esquema Lógico Relacional gerado a partir do DER\napresentado.\n\ntipo de tinta ol\n\n(Odimensões\nO data de aquisição\n\nO título\n\nO código\n\n(1,n)\n\nEscultura\n\nLo material\n\nPintura\n\nTécnica\n\n(O descrição\n\nNo Esquema Lógico Relacional, haverá uma tabela associativa, criada em função do relacionamento\nmuitos para muitos entre as entidades Artista e Técnica, que terá uma chave primária composta\npelo código do artista e o código da técnica.\nNo Esquema Lógico Relacional, haverá uma tabela Artista na qual o atributo código do artista será\na chave primária da tabela, e o código da obra será uma chave estrangeira que fará referência a\numa obra existente na tabela Obra.\nNo Esquema Lógico Relacional, haverá, em função da generalização/especialização, uma tabela\nObra com apenas os atributos código da obra, título, data de aquisição e dimensões, e duas outras\ntabelas: a tabela Pintura, com apenas o atributo tipo de tinta, e a tabela Escultura com apenas o\natributo material.\n\nÉ correto o que se afirma em\n\nO 1 apenas.\nO Il apenas.\nO lelll, apenas.\nO lei, apenas.\n\nO ,llell.\n\n18\n\nSISTEMAS DE INFORMAÇÃO\n\nO nacionalidade\n\ncódigo\n\n2017\nenade AV\n\nExame Nacional de Desempenho\ndos Estudantes"
    },
    {
        "id": "4a196fb7-28d4-4af7-b74d-c50664961be6",
        "ano": "2017",
        "numero": "QUESTÃO 12",
        "conteudo": "A TI Verde está associada à utilização eficiente dos recursos organizacionais e à minimização\ndos efeitos nocivos ao meio ambiente ocasionados pelo uso da Tecnologia da Informação (TI).\nEssas tecnologias são feitas de produtos químicos, metais pesados, materiais sintéticos etc.\nConsiderando que existirão 10 bilhões de pessoas no nosso planeta em 2050, teremos que gerir tanto\no impacto ambiental da tecnologia, quanto usar esta mesma tecnologia para ajudar a gerenciar o\nimpacto da espécie humana no planeta.\n\nDisponível em: <http://www.sustentti.com.br>. Acesso em: 21 jul. 2017 (adaptado).\nA partir dessas informações e considerando o conceito de TI Verde, avalie as afirmações a seguir.\n\n|. Um dos pilares da TI Verde é a busca de conscientização do usuário na adoção de ações\nsustentáveis, tais como: reduzir impressões inúteis economizando papel e tinta/toner e evitar o\nenvio desnecessário de e-mails reduzindo o gasto de energia do sistema e do receptor.\n\nIl. Nalinha de eficiência energética estão os data centers verdes, nos quais a virtualização de servidores\npode ser utilizada para fazer com que uma única máquina física, considerando sua capacidade de\nprocessamento, emule diversas máquinas.\n\nHI. Um equívoco comum é considerar ações relativas ao lixo eletrônico como ações de TI Verde a\nserem adotadas pela organização, pois essas questões estão fora de sua governança.\n\nÉ correto o que se afirma em\nO | apenas.\n\nO Ill, apenas.\n\nO lell, apenas.\n\nO lei, apenas.\n\nO Llell.\n\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 19"
    },
    {
        "id": "b8fdccc1-0997-4406-aa68-1ade157c9e12",
        "ano": "2017",
        "numero": "QUESTÃO 13",
        "conteudo": "2017\nE enade\n\nExame Nacional de Desempenho\ndos Estudantes\n\nR 4\n\nAnalise a figura a seguir.\n\nCoordenação administrativa e serviços de apoio\nIntranet de fluxo de trabalho colaborativo\nGerenciamento de recursos humanos\nIntranet de benefícios de funcionários\n\nProcessos\nde apoio Desenvolvimento tecnológico\nExtranet de desenvolvimento de produtos com parceiros\nObtenção de recursos\nPortais de e-commerce para fornecedores\nLogística Operações Logística Marketing Atendimento\nde entrada de saída e vendas ao cliente\nProcessos 4\nde negócio Armazenamento| Produção Pontos de . Gestão do\nprimários automatizado flexível venda e Marketing  Irelacionamento\njust-in-time apoiada por  |processamento| direcionado | com o cliente\ncomputador de pedidos\n\non-line\n\nO'BRIEN, J. A.; MARAKAS, G. M. Administração de sistemas de informação. 15. ed. Porto Alegre: AMGH, 2012 (adaptado).\nA partir da análise da figura, avalie as afirmações a seguir.\n\nI. É apresentado um exemplo de como e onde as tecnologias da informação podem ser aplicadas nos\nprocessos de negócios por meio da estrutura de cadeia de valor.\n\nIl. É sugerido que um fluxo de trabalho colaborativo pela intranet pode aumentar as comunicações\ne colaborações necessárias à significativa melhoria da coordenação administrativa e dos serviços\nde apoio.\n\nIll. É sugerido que os portais de E-Commerce podem melhorar a economia de recursos ao oferecer\nmercados on-line para os fornecedores.\n\nIV. É demonstrado que a vantagem competitiva é ampliada quando a área de Tecnologia da\nInformação (TI) está alinhada ao negócio.\n\nÉ correto o que se afirma em\n\nO Lilelll, apenas.\nO Ile Iv, apenas.\nO Lille Iv, apenas.\nO I,Ille Iv, apenas.\nO LiLillelv.\n\nÁrea livre\n\n20 SISTEMAS DE INFORMAÇÃO\n\n2017\nenade E\n\nExame Nacional de Desempenho\ndos Estudantes"
    },
    {
        "id": "37b2a16c-f8c7-47f5-96f4-876b3bda66e9",
        "ano": "2017",
        "numero": "QUESTÃO 14",
        "conteudo": "No passado, registrar e montar estatísticas sobre jogadas e associá-las a vídeos com momentos do\njogo não era trivial, o que dificultava a tomada de decisão por uma organização esportiva. Atualmente,\nexistem sistemas de informação com capacidade para coletar jogadas, organizá-las em dados estatísticos\ne relacioná-las às imagens de jogos.\n\nPor meio desses sistemas, cada lance dos jogos é registrado de forma detalhada, dissecando-os e\nmarcando-os com o uso de centenas de descritores e associando-os a vídeos em alta resolução. Assim,\ntreinadores podem utilizar o sistema para, em segundos, acessar momentos de interesse e avaliar forças\ne debilidades de jogadores; jogadores podem analisar suas jogadas e se preparar para os próximos jogos;\ntorcedores, \"olheiros\" e patrocinadores podem acessar estatísticas e jogadas. Portanto, é possível criar\numa rede de tomada de decisões, relacionamentos e valores de negócio.\n\nLAUDON, K. C.; LAUDON, J. P. Management information systems. 11. Ed. New Jersey: Pearson, 2010 (adaptado).\nEm relação ao cenário descrito, avalie as afirmações a seguir.\n\nIl. O alto custo dos jogadores, a alta pressão competitiva e a baixa qualidade estatística dos jogos\nsão problemas ou desafios superados por uma organização esportiva que utiliza um sistema de\ninformação.\n\nIl. O desenvolvimento de estratégia para o time, o treinamento e a avaliação de jogadores, são\nfunções gerenciais de uma organização esportiva apoiadas por um sistema de informação.\n\nIl. São funcionalidades de um sistema de informação para uma organização esportiva: geração de\nrelatórios de análise do desempenho de jogadores e relatórios de análise do desempenho de\nequipes.\n\nIV. O aumento do desempenho e da receita dos times são objetivos de negócio impactados com a\nutilização de um sistema de informação por uma organização esportiva.\n\nÉ correto o que se afirma em\n\nO 1 apenas.\n\nO lelll, apenas.\n\nO Ile Iv, apenas.\nO I,Ille Iv, apenas.\nO LiLillelv.\n\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 21\n\nR4 02017\n\nenade”\n\nExame Nacional de Desempenho\n\ndos Estudantes"
    },
    {
        "id": "a539a415-7f14-4a49-ba20-a9f9e5ffe79b",
        "ano": "2017",
        "numero": "QUESTÃO 15",
        "conteudo": "Os sistemas de informação ampliaram sua\nperspectiva de atuação do simples uso do\ncomputador como ferramenta para a rápida\n\nexecução de tarefas rotineiras até o campo dos\nnegócios. Tal fato, aliado às possibilidades providas\npelas Tecnologias da Informação e Comunicação\n(TIC) e pelos avanços específicos em hardware,\nsoftware, nuvem, conectividade e redes sociais,\nampliou as exigências em relação aos sistemas.\n\nComo forma de contribuir para o processo de\ndesenvolvimento e implantação, surgiu a abordagem\nda Arquitetura de Sistemas de Informação (ASI).\nInicialmente tratada como arquitetura de dados,\na ASI acompanhou a evolução dos sistemas\nde informação e incorporou uma visão mais\nabrangente, com a inclusão das perspectivas de\nnegócio, da visão organizacional, da evolução das\nTIC e dos usuários.\n\nTAIT, T. F. C.; PACHECO, R. C. S.; ABREU, A. F. Arquitetura de sistemas\nde informação: análise comparativa de modelos. Produção,\nRio de Janeiro, v. 9, n. 1 p. 55-64, 1999 (adaptado).\n\nConsiderando esse cenário, avalie as asserções a\nseguir e a relação proposta entre elas.\n\nIl A abordagem ASI estabelece um\nmapeamento da organização que considera\nos elementos envolvidos com o processo de"
    },
    {
        "id": "36da06d4-bf72-43d0-8156-ce8b6f931ab3",
        "ano": "2017",
        "numero": "QUESTÃO 16",
        "conteudo": "O processo de design de interação possui quatro\natividades básicas: identificar as necessidades\ne estabelecer requisitos, desenvolver designs\n\nalternativos que preencham estes requisitos,\nconstruir versões interativas dos designs e\navaliação.\n\nNesse contexto, avalie as afirmações a seguir.\n\nIl. O processo de design de interação é\ncomplementar aos modelos de ciclo de vida\nde desenvolvimento de software.\n\nIl. A participação do usuário do sistema no\nprocesso de design de interação é dispensável,\numa vez que os desenvolvedores conhecem\ntodas as regras referentes ao web design.\n\nlt. A observação de designs de interação\ndesenvolvidos por outros profissionais\nmotiva os designers para soluções\nalternativas.\n\nIV. A prototipação é uma técnica para facilitar\no feedback do usuário nas etapas do\nprocesso de design de interação.\n\nÉ correto apenas o que afirma em\n\ndesenvolvimento/implantação de sistemas | Q |.\nde informação. O leiv\nPORQUE :\n= Q o . O Lllell.\nIH. O objetivo da ASI é inter-relacionar o\ndados, disponibilizar hardware, software L le IM.\ne recursos de redes, para processar | O IL Ille IV.\ntransações, produzir informação e suportar Área livre\numa variedade de domínios de aplicação.\nA respeito dessas asserções, assinale a opção\ncorreta.\nO As asserções le Il são proposições verdadeiras,\nea Il é uma justificativa correta de |.\nO As asserções le Il são proposições verdadeiras,\nmas a Il não é uma justificativa correta de |.\nO Aasserção | é uma proposição verdadeira, ea ll\né uma proposição falsa.\nO Aasserção | é uma proposição falsa, e a Il é uma\nproposição verdadeira.\nO Asasserçõesle Il são proposições falsas.\n22 SISTEMAS DE INFORMAÇÃO\n\n2017\nenade AM\n\nExame Nacional de Desempenho\ndos Estudantes"
    },
    {
        "id": "67357173-b5f4-4c00-9499-920cf921e31a",
        "ano": "2017",
        "numero": "QUESTÃO 17",
        "conteudo": "Uma equipe de projeto desenvolveu um aplicativo mobile para a gestão de frotas de caminhões entre os\nmeses de janeiro e junho de 2017. O projeto seguiu um processo baseado no modelo de ciclo de vida de\ndesenvolvimento em cascata, com atividades realizadas sequencialmente e sem sobreposição.\n\nAo final do projeto, a equipe precisou tratar uma grande quantidade de defeitos encontrados no aplicativo\nem um curto espaço de tempo. Como mostra o gráfico a seguir, a maior parte dos defeitos foi identificada\nao final do projeto, o que elevou o risco de se entregar o aplicativo com muitos defeitos ao cliente.\n\nFrequência mensal de defeitos do aplicativo desenvolvido no projeto\n\n20 7\n\n157\n\n104\n\nQuantidade de defeitos identificados\n\nDiante desse cenário, a equipe do projeto decidiu que, em novos projetos, realizaria ações que pudessem\ndistribuir o esforço de tratamento de defeitos ao longo dos meses, diminuindo o risco de ainda haver\nmuitos defeitos não tratados no momento próximo à entrega do produto.\n\nConsiderando a situação, o gráfico apresentado e o modelo de ciclo de vida de desenvolvimento utilizado\nno projeto (cascata), assinale a opção que descreve uma ação capaz de produzir o resultado esperado\npela equipe.\n\nQ Realizar testes assim que o aplicativo estiver pronto para uso.\n\nO Aplicar técnicas de verificação e validação desde o início do projeto.\n\nO Mapear e documentar o processo de desenvolvimento utilizado e comunicá-lo à equipe.\n\nO licitar e documentar os requisitos funcionais e não funcionais do produto logo no início do projeto.\n\nO Registrar, evidenciar e comunicar imediatamente os defeitos encontrados aos demais membros da equipe.\n\nSISTEMAS DE INFORMAÇÃO 23\n\n* R4 020172 4 *\n\nenade”\n\nExame Nacional de Desempenho\n\ndos Estudantes"
    },
    {
        "id": "f83d8b04-2cc6-4251-80c3-c1291e0a70a0",
        "ano": "2017",
        "numero": "QUESTÃO 18",
        "conteudo": "Uma empresa iniciou um projeto para implantação\nde um ERP (Enterprise Resource Planning), com o\nobjetivo de aumentar a produtividade e elevar seu\npatamar tecnológico. O sistema que era utilizado\nanteriormente foi desenvolvido pela própria\nempresa e não mais atendia às necessidades\noperacionais. A empresa optou por implantar\num módulo WMS (Warehouse Management\nSystem), que se ocupa de tarefas relacionadas\nao gerenciamento das operações de estoques.\nO módulo foi parametrizado e customizado de\nacordo com as necessidades identificadas na fase\nde planejamento do projeto de implantação.\n\nA partir do caso apresentado, avalie as asserções a\nseguir e a relação proposta entre elas.\n\nIl. Customização é a modificação de um\nsistema ERP para que ele possa adaptar-se\na determinada situação empresarial que\nnão pode ser reproduzida por parâmetros\npreexistentes.\n\nPORQUE\n\nIH. A parametrização é o processo de\ndeterminação do comportamento de um\nsistema ERP por meio da definição dos\nvalores de parâmetros disponibilizados por\nele, que são variáveis internas.\n\nA respeito dessas asserções, assinale a opção\ncorreta.\n\nO Asasserçõesle Il são proposições verdadeiras e\na Il é uma justificativa correta da |.\n\nO As asserções le Il são proposições verdadeiras,\nmas a Il não é uma justificativa correta da |.\n\nO A asserção | é uma proposição verdadeira, e a Il\né uma proposição falsa.\n\nO Aasserção | é uma proposição falsa, e a Il é uma\nproposição verdadeira.\n\nO Asasserçõesle Il são proposições falsas."
    },
    {
        "id": "89101b12-d084-4e19-97b2-5ccea6e7e98e",
        "ano": "2017",
        "numero": "QUESTÃO 19",
        "conteudo": "A teoria dos grafos estuda as relações entre\nelementos em um determinado conjunto.\nUm grafo G (V, E) é determinado por um conjunto\nnão vazio de vértices (V) e um subconjunto de pares\nde vértices não ordenados, chamados arestas (E).\n\nA figura a seguir representa a possibilidade\nde voos de uma companhia aérea tal que\n\nV = Porto Alegre, Curitiba, São Paulo,\nRio de Janeiro e Brasília), representa\no conjunto das capitais (vértices), e\n\nE = ((Porto Alegre, Curitiba), (Curitiba, São\nPaulo), (São Paulo, Rio de Janeiro), (Porto\nAlegre, Rio de Janeiro), (São Paulo, Brasília),\nrepresenta essas possíveis conexões (arestas)\n\nentre as capitais.\nRio de Janeiro\n\nBrasília\n\nPorto Alegre\n\nCom base nas informações apresentadas, avalie as\nafirmações a seguir.\n\nIl. São Paulo é adjacente a Porto Alegre.\nIl. Porto Alegre possui valência igual a 2.\n\nIll. Rio de Janeiro é incidente em São Paulo e\n\nPorto Alegre.\n\nIV. Curitiba possui comprimento igual a 2.\n\nÉ correto apenas o que se afirma em\nQ el.\n\nO lei.\n\nO Ilelv.\n\nO Lielv.\n\nO Lileiv.\n\n24\n\nSISTEMAS DE INFORMAÇÃO\n\n2017\nenade A\n\nExame Nacional de Desempenho\ndos Estudantes"
    },
    {
        "id": "00e2767b-a446-4066-b529-5144c8e25c1a",
        "ano": "2017",
        "numero": "QUESTÃO 20",
        "conteudo": "Em uma seleção para uma vaga de programador, o setor de recursos humanos de uma empresa criou três\nsentenças essenciais para a escolha do candidato, representadas pelas variáveis proposicionais p, qer:\n\ne »p:o candidato tem experiência com a linguagem Python;\ne q:o candidato tem experiência com a linguagem Java;\ne r:o candidato é pouco experiente como programador.\n\nA partir das três sentenças criadas, foi gerada uma proposição composta S para avaliação dos candidatos:\nS=(pvaa (gana).\n\nAssinale a opção que representa corretamente a tabela-verdade do cálculo proposicional S.\n\nr r |(pva) |(gna2)\nv|yv v v v|yv v F\no\nplalr (va |(anon|S plalr (va |(anon|S\nvivIyv v v v vivIyv v F F\nElvIyv v v v ElvIyv v F F\nFIFIE F F F FIFIE F F F\n:\nFIV F F\no\nFIV F F\nF F y\nSISTEMAS DE INFORMAÇÃO 25\n\nR 4\n\n020172 6%"
    },
    {
        "id": "53cb3fae-16a7-41aa-a750-f884a6e5fc09",
        "ano": "2017",
        "numero": "QUESTÃO 21",
        "conteudo": "enade”\n\nExame Nacional de Desempenho\ndos Estudantes\n\nUma startup de tecnologia pretende desenvolver um aplicativo que aproxime empresas que precisam\n\ntransportar mercadorias de condutores autônomos de veículos de carga (transportadores). O uso do\n\naplicativo permitirá um aumento do número potencial de transportadores e de tipos de veículos, bem\n\ncomo o compartilhamento de frete, com redução do custo de transporte e do custo de armazenamento\n\nde mercadorias pelas empresas. Além disso, a visibilidade da disponibilidade dos transportadores pelo\n\naplicativo pode aumentar suas possibilidades de negócios. Durante a concepção e o projeto do aplicativo,\n\nforam elaborados modelos UML (Unified Modeling Language), sendo um deles o diagrama de atividades,\n\nconforme apresentado na figura a seguir.\n\nN\n\nO\n\nEmpresa que precisa do transporte\n\nInformar origem, destino\ne tipo de carga\n\nIN\nestado inicial\n\nPreparar a carga\npara transporte\n\nIN\nponto de decisão 1\n\nN\nponto de decisão 2\n\nAplicativo Transportador\n\nVerificar veículos\ndisponíveis\n\nh\nestado final\n\n[há veículos disponíveis]\n\nVerificar rota e\ndestinos\n\nVerificar tipo de veículo\n\nponto de decisão 3\n\nInformar\nindisponibilidade\n\n[tipo de veículo é\nadequado ao tipo\nde carga]\n\nconfirmar disponibilidade\n\n[o motorista atende\nà solicitação positivamente]\n\ncalcular valor e tempo de espera\n\nInformar dados do caminhão, valor\ne tempo de espera\n\n26\n\nSISTEMAS DE INFORMAÇÃO\n\n2017\nenade EE\n\nExame Nacional de Desempenho\ndos Estudantes\n\nCom base no diagrama apresentado, avalie as afirmações a seguir.\n\nOs serviços oferecidos por outros aplicativos, como mapas para o cálculo de rotas, por exemplo,\npoderão ser usados no desenvolvimento do aplicativo, mesmo que não tenham sido representados\nno diagrama.\n\nOs fluxos paralelos indicados nos pontos de decisão 2 e 3 levam a erros no funcionamento do\naplicativo, uma vez que permitem a continuidade do processo mesmo que não haja rota, destino\nou tipo de veículo adequado.\n\nO diagrama apresenta atividades desempenhadas pela \"Empresa que precisa de transporte\" e pelo\n\"Transportador\", no entanto, as atividades que precisarão ser modeladas no sistema restringem-se\nàs desempenhadas pelo \"Aplicativo\".\n\nAs ações \"Informar indisponibilidade\"” e \"Confirmar disponibilidade\" correspondem a\nfuncionalidades distintas no sistema, visto que a primeira se relaciona à existência de tipo de\nveículo, rota e destino e a segunda se relaciona à agenda do transportador.\n\nÉ correto apenas o que se afirma em\n\nQ el.\nO lei.\nO Itein.\nO 4ileiv.\nO Illleiv."
    },
    {
        "id": "887884be-38b7-4d71-a0e1-e1c8ce0c1d06",
        "ano": "2017",
        "numero": "QUESTÃO 22",
        "conteudo": "A tendência atual de desenvolver aplicações que possam ser utilizadas em nuvem otimiza o\ndesempenho de máquinas locais, munidas de poucos recursos computacionais, em uma rede\ne garante a possibilidade desses computadores utilizarem outros recursos computacionais de\nmaior desempenho, bem como a inserção de novos hosts neste ambiente computacional, sem\ncomprometimento do sistema como um todo.\n\nEsse cenário pressupõe a utilização de sistema operacional com\n\nO arquitetura monolítica.\n\nO arquiteturas em camadas.\n\nO arquitetura monocamadas.\n\nO arquiteturas cliente-servidor.\n\nO arquiteturas de máquinas virtuais.\n\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 27\n\n2017\nEEN enade\n\nExame Nacional de Desempenho\ndos Estudantes"
    },
    {
        "id": "19d7b0c7-09bd-4afe-9831-edd315468a8f",
        "ano": "2017",
        "numero": "QUESTÃO 23",
        "conteudo": "No modelo de dados relacional, uma junção entre tabelas cria uma pseudo-tabela derivada de duas\nou mais tabelas de acordo com os critérios especificados, similar às regras da teoria dos conjuntos.\nNos conjuntos a seguir, as áreas hachuradas representam os resultados das consultas SQL (padrão) em\nque, id é uma chave primária e £fk uma chave estrangeira.\n\nConjuntos Consultas SQL equivalentes\n\nSELECT * FROM Tabelal;\n\nTabela SELECT * FROM Tabela2;\n\nTabela2\n\nSELECT * FROM Tabelal t1;\nINNER JOIN Tabela2 t2\nON tl.id = t2.fk;\n\nTabelal Tabela2\n\nSELECT * FROM Tabelal t1;\nTabelal Tabela2 LEFT JOIN Tabela2 t2\nON tl.id = t2.£fk;\n\nAssinale a opção em que a declaração SQL é equivalente ao conjunto apresentado a seguir.\n\nTabelal ) Tabela2\n\nO SELECT * FROM Tabelal tl JOIN Tabela2 t2 ON t1l.id = t2.fk;\n\nO SELECT * FROM Tabelal tl RIGHT JOIN Tabela2 ON tl.id = t2.fk WHERE\nt2.fk <> NULL;\n\n[C) SELECT * FROM Tabelal tl WHERE EXISTS (SELECT 1 FROM Tabela2 t2 WHERE\nt2.id = t1.£fk);\n\nO SELECT * FROM Tabelal tl RIGHT JOIN Tabela2 t2 ON t1l.id = t2.fk WHERE\ntl.id is NULL;\n\nE) SELECT * FROM Tabelal tl WHERE NOT EXISTS (SELECT 1 FROM Tabela2 t2\nWHERE t2.id = t1.fk);\n\nÁrea livre\n\n28 SISTEMAS DE INFORMAÇÃO\n\nenade\n\nExame Nacional de Desempenho\n\n* R4 02017209 *\n\ndos Estudantes"
    },
    {
        "id": "79e94c56-204f-4f02-8111-d199bdd32dbd",
        "ano": "2017",
        "numero": "QUESTÃO 24",
        "conteudo": "Em uma pesquisa de satisfação com notas de O a\n10, sendo O muito insatisfeito e 10 muito satisfeito,\numa empresa construiu um quadro, mostrado a\nseguir, com o resumo das notas atribuídas pelos\nseus clientes aos serviços recebidos.\n\nQUANTIDADE\n\nNOTA DE CLIENTES\n0 0\n1 0\n2 0\n3 1\n4 2\n5 2\n6 2\n7 2\n8 2\n9 1\n10 0\n\nConsiderando essa situação e as informações\napresentadas, avalie as afirmações a seguir.\n|. A média das notas dos clientes é igual a 6,0.\nIl. A mediana das notas dos clientes é igual a 6,0.\nIll. O desvio padrão populacional é menor do"
    },
    {
        "id": "f5ce86a6-09da-45ae-923c-feab9e586f72",
        "ano": "2017",
        "numero": "QUESTÃO 25",
        "conteudo": "Nos últimos anos, a melhoria do desempenho\norganizacional por meio da identificação,\navaliação e melhoria dos processos de negócio\norganizacionais tem-se tornado uma prática\npadrão nas organizações ao redor do mundo\ne tem sido reconhecida como uma disciplina,\ndenominada Gestão de Processos de Negócio.\n\nO primeiro passo da gestão de processos é\nidentificar que processo de negócio se deseja\nmelhorar. Sem clarificar exatamente qual é o\nprocesso, torna-se difícil controlar o escopo de\num projeto de melhoria de processos, pois, em\nqualquer organização, todas as atividades estão,\nde alguma forma, relacionadas.\n\nSHARP, A.; MCDERMOTT, P. Workflow modeling. 2. ed. Boston:\nArtech House, 2009 (adaptado).\n\nConsiderando as informações apresentadas,\nassinale a opção que corresponde a um processo\nde negócio que deve ser selecionado para análise\npelo projeto de melhoria de processos de uma\norganização.\n\nO Criar conta de cliente.\n\nO Prospectar novos clientes.\n\nO Comércio eletrônico via Web.\n\nO Relacionamento com clientes.\n\nO Calcular a faixa de crédito de cliente.\n\nque 3,0. -\nIV. O conjunto de dados é amodal. Área livre\nV. Um cliente que atribuiu nota 3,0 encontra-se\nno 1º quartil.\nÉ correto apenas o que se afirma em\nO lei.\nO Lllev.\nO Lilelv.\nO Iivev.\nO Il, Ivev.\nÁrea livre\nSISTEMAS DE INFORMAÇÃO 29\n\nR 4\n\n* 02017 30%\n\nenade”\n\nExame Nacional de Desempenho\n\ndos Estudantes"
    },
    {
        "id": "f1f7b830-0f96-4b77-adb7-f529919fd53d",
        "ano": "2017",
        "numero": "QUESTÃO 26",
        "conteudo": "Algumas linguagens de programação obedecem\na uma ordem específica no que diz respeito à\navaliação de operadores. A precedência dos\noperadores aritméticos, relacionais e booleanos\né demonstrada na tabela a seguir, na qual\nos operadores ++ e --, pré ou pós-fixados,\nrespectivamente, incrementam ou decrementam a\nvariável, como no exemplo: variável x com valor 0,\nresultado de++x éigual a 1eode--x é igual\na -l.\n\nOrdem de precedência\n(do maior para o menor) Operadores\n1 ++ e —- pós-fixados\n3 + e — unários, ++ e\n-- pré-fixados, !\n3 *, /,%\n4 + e -— binários\n5 <, >, <=, >=\n6 = |=\n7 &&\n8 [|\n\nSEBESTA, R. W. Conceitos de linguagens de programação.\nPorto Alegre: Bookman, 2011 (adaptado).\n\nConsiderando essas informações e sabendo que\nas variáveis a, b e c têm, em determinado\nmomento, os valores 1, 2 e 0, respectivamente,\nassinale a opção em que o resultado da\nexpressão apresentada corresponde ao da"
    },
    {
        "id": "bdfb8ab8-9b4b-489b-ac32-32bb56362e93",
        "ano": "2017",
        "numero": "QUESTÃO 27",
        "conteudo": "A forma como o conhecimento se apresenta\npode ser classificada em tácita e explícita.\nO conhecimento tácito é desenvolvido pelas\nexperiências e relacionamentos pessoais ou\nprofissionais de um indivíduo, não é mensurável\ne é pessoal. O conhecimento explícito é a\ndisseminação, aplicação, transmissão, de\nmaneira formal, do conhecimento adquirido.\nTAKEUCHI, H.; NONAKA, |. Gestão do conhecimento.\nPorto Alegre: Bookman, 2008 (adaptado).\nConsiderando o desenvolvimento de software e a\nutilização do conhecimento tácito e explícito, avalie\nas afirmações a seguir.\n\nIl. Durante as etapas de desenvolvimento\ndo software, são utilizados tanto os\nconhecimentos pré existentes do indivíduo\nquanto os conhecimentos adquiridos\ndurante o desenvolvimento.\n\nIl. O uso do conhecimento explícito restringe-se\nàs fases de levantamento dos requisitos,\nquando o usuário indica sua necessidade\ne as funcionalidades requeridas para o\ndesenvolvimento do software.\n\nIll. O uso do conhecimento tácito restringe-se\nàs fases de desenvolvimento, quando se\nemprega conhecimento de transformação\nda necessidade do usuário e características\ntécnicas para produzir um sistema de\ninformação.\n\nexpressão-a * ++b- --c. É correto o que se afirma em\nQa*:bH---c O |, apenas.\nO-b>arc O Ill, apenas.\n\nO--c/a * --b O lei, apenas.\n\nO ++c/--b * ++a O Ile ll, apenas.\n\nO -a + btt —- cc O Llell.\n\nÁrea livre Área livre\n\n30 SISTEMAS DE INFORMAÇÃO\n\nenade\n\nExame Nacional de Desempenho\n\n* R4 02017 31 *\n\ndos Estudantes"
    },
    {
        "id": "f19d17c2-7041-43a3-93c6-b087e038cfcf",
        "ano": "2017",
        "numero": "QUESTÃO 28",
        "conteudo": "O guia PMBOK (Project Management Body\nof Knowledge) orienta a gestão de projetos\nconsiderando que processos devem ser executados\nnas diversas fases do gerenciamento, a saber:\niniciação, planejamento, execução e encerramento.\n\nEm um determinado projeto, foi desenvolvido\num sistema segundo o modelo de ciclo de vida\nem cascata, cujas atividades são realizadas\nsequencialmente e sem sobreposição. Na atividade\nde homologação do sistema, às vésperas da\ndata planejada de sua implantação, um usuário\nidentificou a inviabilidade de uma funcionalidade\ntestada, pois alguns requisitos básicos não haviam\nsido considerados durante o levantamento dos\nrequisitos. A alteração que se mostrou necessária\natrasou o projeto em relação à linha de base do\nplano do projeto.\n\nSegundo o PMBOK, pode-se considerar que a falha\nfoi originada na fase de\n\nO iniciação ou planejamento, em um processo da\nárea de conhecimento gestão do tempo.\n\nplanejamento ou execução, em um processo da\nárea de conhecimento gestão do tempo.\n\nO execução ou encerramento, em um processo da\nárea de conhecimento gestão do tempo.\n\niniciação ou encerramento, em um processo da\nárea de conhecimento gestão do escopo.\n\nplanejamento ou execução, em um processo da\nárea de conhecimento gestão do escopo.\n\nÁrea livre"
    },
    {
        "id": "3dec7cde-9a14-4d45-9df2-ebc0266b8ef8",
        "ano": "2017",
        "numero": "QUESTÃO 29",
        "conteudo": "Uma empresa que vende produtos cosméticos\ncom vendas diretas conta com diferentes módulos\nde software que atendem aos níveis operacional,\ntático e estratégico. Após diagnóstico situacional,\nverificou-se a possibilidade de melhoria na\noperação e no suporte do processo \"Revisão do\nplano de vendas\", exibido na figura a seguir.\n\nT\n1\nDiretoria de | Revisão do\n\nmarketing | plano de\n! vendas\n1\n1\n\no in\n! x\nDepartamento! Comparação\n\nde vendas ! previsto\n1\n1\n1\n|\n\nSetorde |\n\nvendas |! Apuração\n\n| das vendas\n1\n1\n\nOs atores envolvidos no processo são o setor de\nvendas, o departamento de vendas e a diretoria\nde marketing. Inicialmente, o setor de vendas\nfaz a apuração das vendas no período. Com base\nnessa informação, o departamento de vendas\nfaz a comparação entre as vendas realizadas e as\nprevistas. Por fim, a diretoria de marketing, baseada\nnessa comparação, realiza o plano de vendas.\n\nNessa situação, caso se decida implementar\na tecnologia BPMS (Business Process\nManagement System), o impacto decorrente\ndessa implementação será\n\nO redução do tempo de envio e recebimento dos\ndados entre os níveis organizacionais.\n\nO redução de despesas de vendas como\ndecorrência da melhoria do processo.\nO redução na quantidade de módulos\n\nindependentes necessários\n\nsistema.\n\npara operar o\n\nO maior precisão na previsão de vendas como\ndecorrência da melhoria do processo.\n\nO maior precisão no plano de vendas como\ndecorrência da melhoria do processo.\n\nSISTEMAS DE INFORMAÇÃO 31\n\n* R4 02017 32 *\n\nenade”\n\nExame Nacional de Desempenho\n\ndos Estudantes"
    },
    {
        "id": "9c801fc3-3961-4423-9a1e-99170b13e0b3",
        "ano": "2017",
        "numero": "QUESTÃO 30",
        "conteudo": "Para garantir a qualidade no desenvolvimento de\nsoftware é indispensável definir processos para\ngerenciar mudanças no escopo do produto e\nconfigurações do software em desenvolvimento.\nEsses processos incluem atividades de planejamento,\nvalidação, verificação e gerenciamento de versões\n(mudanças ou releases).\n\nConsiderando as informações apresentadas, avalie\nas afirmações a seguir.\n\n|. O gerenciamento de mudanças acompanha\na solicitação de alterações no software,\ndefine os custos, seus impactos e quando\nestas devem ser implementadas.\n\nIl. A revisão dos artefatos de software tem\npor objetivo armazenar a documentação\nem um repositório central.\n\nHI. A verificação de software tem o objetivo de\ncontrole de versões da documentação.\n\nIv. A validação de software tem o objetivo de\ngarantir que as necessidades e expectativas\ndo cliente sejam atendidas.\n\nV. O gerenciamento de configuração controla\na edição simultânea dos artefatos do\nsoftware, mantém o controle das versões\ndo software e recomenda a auditoria das\nconfigurações.\n\nÉ correto apenas o que se afirma em"
    },
    {
        "id": "b56766e0-6986-4ff5-a016-a5d5cd250178",
        "ano": "2017",
        "numero": "QUESTÃO 31",
        "conteudo": "A cloud computing (computação em nuvem) tem\no objetivo de fornecer recursos de hardware e\nsoftware sob demanda a partir de servidores\ninterligados pela internet, seguindo o princípio\nda computação em grid (grade). Uma arquitetura\nem grid é descrita por meio das quatro camadas a\nseguir.\ne Rede: executa a comunicação e se utiliza da\nparte física;\ne Recursos: formada pelos servidores de\narmazenamento e/ou processamento;\ne Middleware: formada pelo software\nresponsável pela troca de informações;\ne Ferramentas e aplicações:\npelos aplicativos.\n\nrepresentada\n\nDe acordo com o texto, avalie as afirmações a\nseguir.\n\nIl. A camada de ferramentas e aplicações é\nresponsável pela negociação das transações\nde dados no grid.\n\nIl. A camada middleware é responsável pela\ninterconectividade e comunicação entre os\nmembros do grid.\n\nll. A camada de rede é reponsável pela\nconcectividade entre os diferentes membros\ndo grid.\n\nIV. A camada de recursos é responsável pela\n\nO piel. segurança dos dados nas aplicações do grid.\nO itelv. É correto apenas o que se afirma em\nLIVev.\n9 OQ lei.\nO Ipilev.\nO Ilivey O el.\nIVev.\nj O ltelv.\nÁrea livre O Lilely\nO ,illelv.\nÁrea livre\n32 SISTEMAS DE INFORMAÇÃO\n\n2017\nenade A\n\nExame Nacional de Desempenho\ndos Estudantes"
    },
    {
        "id": "da21d981-b013-4cce-9a25-6be0318e3af3",
        "ano": "2017",
        "numero": "QUESTÃO 32",
        "conteudo": "A lei Sarbanes-Oxley (SOX), publicada em agosto de 2002, após escândalos financeiros acontecidos em\ncompanhias americanas abertas nos Estados Unidos, objetiva proteger os investidores, no mercado de\ncapital americano, de fraudes contábeis e financeiras. Entre os diversos controles que essa lei regula,\ndestacam-se aqueles que devem garantir a integridade de informações contábeis e financeiras. Tal crise\ndespertou a importância da temática Governança de Tecnologia da Informação (TI) para as organizações,\nde modo a serem considerados requisitos legais a troca de informações entre parceiros estratégicos das\norganizações e a formalização de uma política de segurança da informação, entre outros. Desta forma,\ncabe destacar que o objetivo da Governança de TI em uma organização é alinhar a TI aos requisitos\nde negócio, de modo a garantir a continuidade dos serviços prestados, bem como a minimização da\nexposição do negócio aos riscos de TI.\n\nFERNANDES, A.A.; ABREU, V. D. Implantando a governança de TI: da estratégia à gestão dos processos e serviços.\nRio de Janeiro: Brasport, 2012 (adaptado).\n\nA respeito desse contexto, avalie as afirmações a seguir.\n\nIl. O atendimento a marcos de regulação (compliance) implicam, para a área de TI, que os sistemas\nde informação transacionais de uma organização, geradores de fatos contábeis e financeiros,\npossibilitem o acesso e a emissão de relatórios de resultados.\n\nIl. A segurança da informação deve ser focada prioritariamente na proteção da infraestrutura de\nservidores que armazenam as informações transacionais, como contábeis e financeiras.\n\nHI. A integração tecnológica entre filiais de uma organização, ou seja, entre elos de uma cadeia de\ndistribuição, bem como a gestão de clientes altamente sofisticados, ou seja, entre elementos que\nultrapassam as fronteiras da organização, devem ser consideradas no momento de se alinhar a TI\naos requisitos de negócio.\n\nIV. Em grandes organizações brasileiras e multinacionais, a implementação de “centro de serviços\ncompartilhados” visa centralizar diversas áreas de negócio, assim como determinadas operações\ne/ou serviços de TI.\n\nÉ correto apenas o que se afirma em\n\nOle.\nO ein.\nOlelv.\nO 4ileiv.\nO Illleiv.\n\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 33\n\n* 0201734 +\n\nR 4\n\nenade”\n\nExame Nacional de Desempenho\n\ndos Estudantes"
    },
    {
        "id": "72512674-e979-4362-869c-10cd47271e70",
        "ano": "2017",
        "numero": "QUESTÃO 33",
        "conteudo": "Tendo em vista que a informação está entre os\nbens mais importantes para uma organização, um\ndos fatores decisivos na definição de uma rede de\ncomputadores é a segurança da informação. Para\ngarantir tal segurança e evitar qualquer desvio ou\nação que possa modificar essas informações sem\nautorização ou, ainda, para protegê-las de ataques\ncibernéticos, são necessários planejamentos e\nestruturação da rede e de seus acessos.\nFONTES, E. Praticando a segurança da informação. 1. ed.\nSão Paulo: BRASPORT, 2008 (adaptado).\nConsiderando o texto, avalie as afirmações a seguir.\n\nIl. A proteção da informação em uma\norganização é competência restrita à\nárea de tecnologia, que assume total\nresponsabilidade sobre sua segurança.\n\nIl. A proteção da informação exige postura e\ncomprometimento dos envolvidos na sua\nexecução, portanto, deve ser tratada de\nforma profissional.\n\nll. A presença de funcionários éticos na\nempresa elimina a necessidade de\ninvestimentos na área de segurança da\ninformação.\n\nIv. Os ataques cibernéticos são cada dia\nmais frequentes, por isso, a segurança da"
    },
    {
        "id": "4da3f698-e3ce-4ee4-bcc4-9975d7d723f9",
        "ano": "2017",
        "numero": "QUESTÃO 34",
        "conteudo": "No contexto de arquitetura e organização de\ncomputadores, otermo cluster é usado para designar\num grupo de computadores interconectados,\ntrabalhando como um recurso de computação\nunificado. Cada computador pertencente ao cluster\né usualmente denominado nó. Clusters costumam\nser utilizados em ambientes corporativos, sendo\nparticularmente adequados para aplicações\nbaseadas em servidores.\nSTALLINGS, W. Arquitetura e organização de computadores.\n8. ed. São Paulo: Prentice Hall, 2010 (adaptado).\nConsiderando as informações apresentadas, avalie\nas afirmações a seguir.\n\n1. Uma falha em um nó de um cluster implica\nem perda total de serviço.\n\nIl. A interligação entre os nós de um cluster\nrealiza-se por meio de um barramento de\ncontrole.\n\nHI. A escalabilidade de um cluster é maior do\nque a de um processador com múltiplos\nnúcleos.\n\nIV. A relação custo/desempenho de um cluster\né melhor do que a de uma única máquina de\ngrande porte.\n\nÉ correto apenas o que se afirma em\n\ninformação deve ser considerada essencial. | O lelll.\nÉ correto o que se afirma em O ltelv.\nO lelv.\nQ Il apenas.\nO Lilell.\nO lelll, apenas.\nO Lilelv.\nO Ile Iv, apenas. -\nO Lite Iv, apenas. Área livre\nO LiLlleiv.\nÁrea livre\n34 SISTEMAS DE INFORMAÇÃO\n\n2017\nenade A\n\nExame Nacional de Desempenho\ndos Estudantes"
    },
    {
        "id": "64af7eae-dfdc-4591-9767-a98b0a9b5e31",
        "ano": "2017",
        "numero": "QUESTÃO 35",
        "conteudo": "O coordenador geral de um comitê olímpico solicitou a implementação de um aplicativo que permita o\nregistro dos recordes dos atletas à medida que forem sendo quebrados, mantendo a ordem cronológica\ndos acontecimentos, e possibilitando a leitura dos dados a partir dos mais recentes.\n\nConsiderando os requisitos do aplicativo, a estrutura de dados mais adequada para a solução a ser\nimplementada é\n\n(A)\n\n(B)\n\no deque: tipo especial de lista encadeada, que permite a inserção e a remoção em qualquer das\nduas extremidades da fila e que deve possuir um nó com a informação (recorde) e dois apontadores,\nrespectivamente, para os nós próximo e anterior.\n\na fila: tipo especial de lista encadeada, tal que o primeiro objeto a ser inserido na fila é o primeiro a ser\nlido; nesse mecanismo, conhecido como estrutura FIFO (First In — First Out), a inserção e a remoção\nsão feitas em extremidades contrárias e a estrutura deve possuir um nó com a informação (recorde) e\num apontador, respectivamente, para o próximo nó.\n\na pilha: tipo especial de lista encadeada, na qual o último objeto a ser inserido na fila é o primeiro a\nser lido; nesse mecanismo, conhecido como estrutura LIFO (Last In — First Out), a inserção e a remoção\nsão feitas na mesma extremidade e a estrutura deve possuir um nó com a informação (recorde) e um\napontador para o próximo nó.\n\na fila invertida: tipo especial de lista encadeada, tal que o primeiro objeto a ser inserido na fila é o\nprimeiro a ser lido; nesse mecanismo, conhecido como estrutura FIFO (First In — First Out), a inserção e\na remoção são feitas em extremidades contrárias e a estrutura deve possuir um nó com a informação\n(recorde) e um apontador, respectivamente, para o nó anterior.\n\na lista circular: tipo especial de lista encadeada, na qual o último elemento tem como próximo o\nprimeiro elemento da lista, formando um ciclo, não havendo diferença entre primeiro e último, e a\nestrutura deve possuir um nó com a informação (recorde) e um apontador, respectivamente, para o\npróximo nó.\n\nÁrea livre\n\nSISTEMAS DE INFORMAÇÃO 35\n\n* R4 02017 3 6%\n\nenade”\n\nExame Nacional de Desempenho\n\ndos Estudantes\n\nQUESTIONÁRIO DE PERCEPÇÃO DA PROVA\nAs questões abaixo visam levantar sua opinião sobre a qualidade e a adequação da prova que você acabou de realizar.\nAssinale as alternativas correspondentes à sua opinião nos espaços apropriados do CARTÃO-RESPOSTA."
    }
]